{"nodes": [{"op": "null", "name": "input_12", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "6c7a5728a3b114ee", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": []}, {"op": "null", "name": "input_125", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "6be3dd27938895d6", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__3", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "264e358d1dbf32bc", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "50431582488a08b8", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_12", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "8d9857381559bffe", "func_name": "tvmgen_default_fused_cast_divide_12"}, "inputs": [[7, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "caa96616b89797c4", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_4", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[8, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_13", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "fb6f82e2d6857769", "func_name": "tvmgen_default_fused_cast_divide_13"}, "inputs": [[9, 0, 0]]}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "null", "name": "p86", "inputs": []}, {"op": "null", "name": "p87", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_9", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "7026ae4cebab0833", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_9", "out_layout": "", "flatten_data": "0"}, "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_14", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "608d7ece6fd8d965", "func_name": "tvmgen_default_fused_cast_divide_14"}, "inputs": [[15, 0, 0]]}, {"op": "null", "name": "p88", "inputs": []}, {"op": "null", "name": "p89", "inputs": []}, {"op": "null", "name": "p90", "inputs": []}, {"op": "null", "name": "p91", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "27299562959cfefe", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__4", "out_layout": "", "flatten_data": "0"}, "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_111", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "264e358d1dbf32bc", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[21, 0, 0]]}, {"op": "null", "name": "p92", "inputs": []}, {"op": "null", "name": "p93", "inputs": []}, {"op": "null", "name": "p94", "inputs": []}, {"op": "null", "name": "p95", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "f5f8c7f6a15798ec", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "out_layout": "", "flatten_data": "0"}, "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "1fecd4308893ae70", "func_name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast"}, "inputs": [[1, 0, 0], [27, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_15", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0eeb09c7bc47731a", "func_name": "tvmgen_default_fused_cast_divide_15"}, "inputs": [[28, 0, 0]]}, {"op": "null", "name": "p96", "inputs": []}, {"op": "null", "name": "p97", "inputs": []}, {"op": "null", "name": "p98", "inputs": []}, {"op": "null", "name": "p99", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "06e82a42cfc49b69", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "out_layout": "", "flatten_data": "0"}, "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "fa27adaace0bfe80", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[34, 0, 0]]}, {"op": "null", "name": "p100", "inputs": []}, {"op": "null", "name": "p101", "inputs": []}, {"op": "null", "name": "p102", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "77de8dba2b8736c1", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]}, {"op": "null", "name": "p103", "inputs": []}, {"op": "null", "name": "p104", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "out_layout": "", "kernel_layout": "OIHW", "hash": "a8d52321c749ea24", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]}], "arg_nodes": [0, 1, 3, 4, 5, 6, 11, 12, 13, 14, 17, 18, 19, 20, 23, 24, 25, 26, 30, 31, 32, 33, 36, 37, 38, 40, 41], "heads": [[42, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [6, 17, 11, 105, 106, 107, 108, 100, 11, 109, 110, 111, 112, 113, 114, 115, 110, 116, 117, 118, 119, 11, 110, 120, 121, 122, 123, 124, 110, 125, 126, 127, 128, 129, 130, 125, 131, 132, 133, 134, 135, 136, 137]], "shape": ["list_shape", [[1, 64, 128, 128], [1, 64, 256, 256], [1, 64, 128, 128], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [1, 32, 128, 128], [1, 32, 64, 64], [1, 32, 64, 64], [16, 32, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 64, 64], [1, 16, 64, 64], [16, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [64, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 192, 256, 256], [1, 192, 256, 256], [64, 192, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43], "extra": {"inputs": [12, 125], "outputs": [165]}}