{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "514ee75e62af8f4f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "aad22f9d42ab3819", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "c1a2714972f6995c", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "layout": "NCHW", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "d1c84c7ea1b4a4a1", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "97be3d2e99c6d7b3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "4ed73dc5cd3319f1", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_1", 
        "layout": "NCHW", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a339a86c8ca20622", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "44f82481a29f6711", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_2", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "cb616bafe17574b2", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_2", 
        "layout": "NCHW", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "d7f7eea2d683d51c", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "f4738973ef3fa2bd", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_3", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "8f41a8f1878e35e5", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_3", 
        "layout": "NCHW", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "c9d2035c177e581f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "ce381f97c1c6b641", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "73b28650a95471ea", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "a0cd721541e9f7e5", 
        "func_name": "tvmgen_default_fused_concatenate"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "744a6c1c11981f14", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "f4738973ef3fa2bd", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "d0a1ecd3f5f2c111", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "3a8a880cc13869bd", 
        "func_name": "tvmgen_default_fused_concatenate_1"
      }, 
      "inputs": [
        [
          75, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a965cb18127224a2", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "44f82481a29f6711", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          81, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "48c142de550303fe", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "0d688a8f5e75b65e", 
        "func_name": "tvmgen_default_fused_concatenate_2"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "342cb3dc9d979763", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "97be3d2e99c6d7b3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "8ed6ff4ec3ff56f4", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "88c150325a68c3fc", 
        "func_name": "tvmgen_default_fused_concatenate_3"
      }, 
      "inputs": [
        [
          107, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "6a2086c52f9e5d2d", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          108, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "aad22f9d42ab3819", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          113, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_sigmoid", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "hash": "0fa24cfdacbbb811", 
        "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_sigmoid", 
        "data_layout": "NCHW", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ], 
        [
          120, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    15, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    55, 
    56, 
    57, 
    58, 
    61, 
    62, 
    63, 
    64, 
    66, 
    67, 
    68, 
    69, 
    71, 
    72, 
    73, 
    74, 
    77, 
    78, 
    79, 
    80, 
    82, 
    83, 
    84, 
    85, 
    87, 
    88, 
    89, 
    90, 
    93, 
    94, 
    95, 
    96, 
    98, 
    99, 
    100, 
    101, 
    103, 
    104, 
    105, 
    106, 
    109, 
    110, 
    111, 
    112, 
    114, 
    115, 
    116, 
    117, 
    119, 
    120
  ], 
  "heads": [
    [
      121, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 512, 512], 
        [16, 3, 3, 3], 
        [16], 
        [16, 1, 1], 
        [16, 1, 1], 
        [1, 16, 512, 512], 
        [16, 16, 3, 3], 
        [16], 
        [16, 1, 1], 
        [16, 1, 1], 
        [1, 16, 512, 512], 
        [1, 16, 256, 256], 
        [32, 16, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 256, 256], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 256, 256], 
        [1, 32, 128, 128], 
        [64, 32, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 128, 128], 
        [64, 64, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 128, 128], 
        [1, 64, 64, 64], 
        [128, 64, 3, 3], 
        [128], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 64, 64], 
        [128, 128, 3, 3], 
        [128], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 64, 64], 
        [1, 128, 32, 32], 
        [256, 128, 3, 3], 
        [256], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 32, 32], 
        [256, 256, 3, 3], 
        [256], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 32, 32], 
        [256, 128, 3, 3], 
        [128], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 64, 64], 
        [1, 256, 64, 64], 
        [128, 256, 3, 3], 
        [128], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 64, 64], 
        [128, 128, 3, 3], 
        [128], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 64, 64], 
        [128, 64, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 128, 128], 
        [1, 128, 128, 128], 
        [64, 128, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 128, 128], 
        [64, 64, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 128, 128], 
        [64, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 256, 256], 
        [1, 64, 256, 256], 
        [32, 64, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 256, 256], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 256, 256], 
        [32, 16, 3, 3], 
        [16], 
        [16, 1, 1], 
        [16, 1, 1], 
        [1, 16, 512, 512], 
        [1, 32, 512, 512], 
        [16, 32, 3, 3], 
        [16], 
        [16, 1, 1], 
        [16, 1, 1], 
        [1, 16, 512, 512], 
        [16, 16, 3, 3], 
        [16], 
        [16, 1, 1], 
        [16, 1, 1], 
        [1, 16, 512, 512], 
        [1, 16, 3, 3], 
        [1], 
        [1, 1, 512, 512]
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        9, 
        10, 
        5, 
        11, 
        12, 
        13, 
        14, 
        15, 
        16, 
        17, 
        18, 
        19, 
        5, 
        15, 
        20, 
        21, 
        22, 
        23, 
        24, 
        25, 
        26, 
        27, 
        28, 
        15, 
        24, 
        29, 
        30, 
        31, 
        32, 
        33, 
        34, 
        35, 
        36, 
        37, 
        24, 
        33, 
        38, 
        39, 
        40, 
        41, 
        42, 
        43, 
        44, 
        45, 
        46, 
        33, 
        47, 
        48, 
        49, 
        50, 
        42, 
        33, 
        51, 
        52, 
        53, 
        54, 
        42, 
        55, 
        56, 
        57, 
        58, 
        24, 
        59, 
        60, 
        61, 
        62, 
        33, 
        24, 
        63, 
        64, 
        65, 
        66, 
        33, 
        67, 
        68, 
        69, 
        70, 
        15, 
        71, 
        72, 
        73, 
        74, 
        24, 
        15, 
        75, 
        76, 
        77, 
        78, 
        24, 
        79, 
        80, 
        81, 
        82, 
        5, 
        83, 
        84, 
        85, 
        86, 
        15, 
        5, 
        87, 
        88, 
        89, 
        90, 
        15, 
        91, 
        92, 
        93, 
        94, 
        10, 
        95, 
        96, 
        42
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122
  ]
}