{"nodes": [{"op": "null", "name": "input_146", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_155", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "539657b2e6909509", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_12", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "p102", "inputs": []}, {"op": "null", "name": "p103", "inputs": []}, {"op": "null", "name": "p104", "inputs": []}, {"op": "null", "name": "p105", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "90265124936940e1", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[0, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "null", "name": "p109", "inputs": []}, {"op": "null", "name": "p110", "inputs": []}, {"op": "null", "name": "p111", "inputs": []}, {"op": "null", "name": "p112", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_9", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "c09ba6cc46ab4e84", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_9", "out_layout": "", "flatten_data": "0"}, "inputs": [[1, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0]]}, {"op": "null", "name": "p113", "inputs": []}, {"op": "null", "name": "p114", "inputs": []}, {"op": "null", "name": "p115", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "55f0a86f763f5a2e", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "null", "name": "p116", "inputs": []}, {"op": "null", "name": "p117", "inputs": []}, {"op": "null", "name": "p118", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_13", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a7dfc04c22dbba3a", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_13", "out_layout": "", "flatten_data": "0"}, "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]}, {"op": "null", "name": "p119", "inputs": []}, {"op": "null", "name": "p120", "inputs": []}, {"op": "null", "name": "p121", "inputs": []}, {"op": "null", "name": "p122", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_81", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]}, {"op": "null", "name": "p123", "inputs": []}, {"op": "null", "name": "p124", "inputs": []}, {"op": "null", "name": "p125", "inputs": []}, {"op": "null", "name": "p126", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "4d86141f52a22f34", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "e8be31553d65e992", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3"}, "inputs": [[6, 0, 0], [29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0eeb09c7bc47731a", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[30, 0, 0]]}, {"op": "null", "name": "p127", "inputs": []}, {"op": "null", "name": "p128", "inputs": []}, {"op": "null", "name": "p129", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_14", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "9e6d384c311d76dc", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_14", "out_layout": "", "flatten_data": "0"}, "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0]]}, {"op": "null", "name": "p130", "inputs": []}, {"op": "null", "name": "p131", "inputs": []}, {"op": "null", "name": "p132", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1b36144dd31325ea", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]}, {"op": "null", "name": "p133", "inputs": []}, {"op": "null", "name": "p134", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0fa0a8b1c1fd95be", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 4, 5, 7, 8, 9, 10, 12, 13, 14, 16, 17, 18, 20, 21, 22, 23, 25, 26, 27, 28, 32, 33, 34, 36, 37, 38, 40, 41], "heads": [[42, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [4, 70, 112, 113, 114, 115, 21, 119, 120, 121, 122, 65, 123, 124, 125, 74, 126, 127, 128, 4, 129, 130, 131, 132, 74, 133, 134, 135, 136, 4, 74, 4, 137, 138, 139, 21, 140, 141, 142, 4, 143, 144, 17]], "shape": ["list_shape", [[1, 128, 128, 128], [1, 64, 64, 64], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 64, 64], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 192, 256, 256], [1, 192, 256, 256], [256, 192, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [1, 256, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43], "extra": {"inputs": [146, 155], "outputs": [191]}}