{"nodes": [{"op": "null", "name": "input_29", "attrs": {"num_outputs": "1", "num_inputs": "5", "out_layout": "", "kernel_layout": "OIHW", "hash": "3d967ca00673cfc4", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_111", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "6110fb49bee397fb", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "608d7ece6fd8d965", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "b453805ab30bcbb7", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[1, 0, 0]]}, {"op": "null", "name": "p75", "inputs": []}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_9", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "309746cc26a06472", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_9", "out_layout": "", "flatten_data": "0"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0bb784bc0f515dbb", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_5", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "77f569bffe487b96", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "9795236d1df934c7", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3"}, "inputs": [[17, 0, 0], [2, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "fb6f82e2d6857769", "func_name": "tvmgen_default_fused_cast_divide_7"}, "inputs": [[18, 0, 0]]}, {"op": "null", "name": "p86", "inputs": []}, {"op": "null", "name": "p87", "inputs": []}, {"op": "null", "name": "p88", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_21", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "810a6dc65dd83761", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]]}, {"op": "null", "name": "p89", "inputs": []}, {"op": "null", "name": "p90", "inputs": []}, {"op": "null", "name": "p91", "inputs": []}, {"op": "null", "name": "p92", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "3c5686a750576796", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_6", "out_layout": "", "flatten_data": "0"}, "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]}, {"op": "null", "name": "p93", "inputs": []}, {"op": "null", "name": "p94", "inputs": []}, {"op": "null", "name": "p95", "inputs": []}, {"op": "null", "name": "p96", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "a6ba4a477c4105b3", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]]}, {"op": "null", "name": "p97", "inputs": []}, {"op": "null", "name": "p98", "inputs": []}, {"op": "null", "name": "p99", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "77cd10fef054dad2", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0]]}, {"op": "null", "name": "p100", "inputs": []}, {"op": "null", "name": "p101", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "4d0f1507541cae37", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]}], "arg_nodes": [0, 1, 4, 5, 6, 8, 9, 10, 11, 13, 14, 15, 16, 20, 21, 22, 24, 25, 26, 27, 29, 30, 31, 32, 34, 35, 36, 38, 39], "heads": [[40, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [17, 57, 21, 30, 88, 89, 90, 39, 91, 92, 93, 94, 30, 95, 96, 97, 98, 39, 30, 21, 99, 100, 101, 39, 102, 103, 104, 105, 30, 106, 107, 108, 109, 9, 110, 111, 112, 4, 113, 114, 39]], "shape": ["list_shape", [[1, 16, 64, 64], [1, 64, 32, 32], [1, 16, 64, 64], [1, 64, 32, 32], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 32, 32], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 32, 32], [32, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 64, 64], [1, 32, 64, 64], [1, 32, 64, 64], [16, 32, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 64, 64], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 64, 64], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 128, 128], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 256, 256], [1, 16, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41], "extra": {"inputs": [29, 111], "outputs": [149]}}