{"nodes": [{"op": "null", "name": "input_0", "inputs": []}, {"op": "null", "name": "p0", "inputs": []}, {"op": "null", "name": "p1", "inputs": []}, {"op": "null", "name": "p2", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "2e70d6195df7b1a3", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]}, {"op": "null", "name": "p3", "inputs": []}, {"op": "null", "name": "p4", "inputs": []}, {"op": "null", "name": "p5", "inputs": []}, {"op": "null", "name": "p6", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f14094ce170e4d7e", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "5368d86f3206266c", "func_name": "tvmgen_default_fused_nn_max_pool2d", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[9, 0, 0]]}, {"op": "null", "name": "p7", "inputs": []}, {"op": "null", "name": "p8", "inputs": []}, {"op": "null", "name": "p9", "inputs": []}, {"op": "null", "name": "p10", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "24d2e0290102969f", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_1", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "0b8f56d6e185e11a", "func_name": "tvmgen_default_fused_nn_max_pool2d_1", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[15, 0, 0]]}, {"op": "null", "name": "p11", "inputs": []}, {"op": "null", "name": "p12", "inputs": []}, {"op": "null", "name": "p13", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "d0d419c069d2d0d9", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]}, {"op": "null", "name": "p14", "inputs": []}, {"op": "null", "name": "p15", "inputs": []}, {"op": "null", "name": "p16", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "fc2ce70066fe93b0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]}, {"op": "null", "name": "p17", "inputs": []}, {"op": "null", "name": "p18", "inputs": []}, {"op": "null", "name": "p19", "inputs": []}, {"op": "null", "name": "p20", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_2", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "101671e5f706ed74", "func_name": "tvmgen_default_fused_nn_max_pool2d_2", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[29, 0, 0]]}, {"op": "null", "name": "p21", "inputs": []}, {"op": "null", "name": "p22", "inputs": []}, {"op": "null", "name": "p23", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "bb81fae1932409c4", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "67b92c04ebdb3941", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]}, {"op": "null", "name": "p35", "inputs": []}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "89512a9170d0e454", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[15, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 5, 6, 7, 8, 11, 12, 13, 14, 17, 18, 19, 21, 22, 23, 25, 26, 27, 28, 31, 32, 33, 35, 36, 37, 38, 40, 41, 42, 43], "heads": [[29, 0, 0], [39, 0, 0], [44, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 4, 10, 11, 12, 13, 9, 14, 15, 16, 17, 4, 18, 19, 20, 14, 21, 22, 23, 24, 4, 14, 25, 26, 27, 28, 29, 30, 31, 32, 14, 41, 42, 43, 44, 36]], "shape": ["list_shape", [[1, 3, 256, 256], [64, 3, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 128, 128], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [1, 32, 64, 64], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [128, 32, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [1, 128, 64, 64], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [32, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45], "extra": {"inputs": [0], "outputs": [29, 39, 54]}}