{"nodes": [{"op": "null", "name": "input_0", "inputs": []}, {"op": "null", "name": "p0", "inputs": []}, {"op": "null", "name": "p1", "inputs": []}, {"op": "null", "name": "p2", "inputs": []}, {"op": "null", "name": "p3", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "5", "out_layout": "", "kernel_layout": "OIHW", "hash": "3796c78dc6f04748", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "fa27adaace0bfe80", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[5, 0, 0]]}, {"op": "null", "name": "p4", "inputs": []}, {"op": "null", "name": "p5", "inputs": []}, {"op": "null", "name": "p6", "inputs": []}, {"op": "null", "name": "p7", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f14094ce170e4d7e", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "6c7a5728a3b114ee", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "264e358d1dbf32bc", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[12, 0, 0]]}, {"op": "null", "name": "p8", "inputs": []}, {"op": "null", "name": "p9", "inputs": []}, {"op": "null", "name": "p10", "inputs": []}, {"op": "null", "name": "p11", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "50431582488a08b8", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "8d9857381559bffe", "func_name": "tvmgen_default_fused_cast_divide_2"}, "inputs": [[18, 0, 0]]}, {"op": "null", "name": "p12", "inputs": []}, {"op": "null", "name": "p13", "inputs": []}, {"op": "null", "name": "p14", "inputs": []}, {"op": "null", "name": "p15", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "2151d35501e1be7a", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "caa96616b89797c4", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[24, 0, 0]]}, {"op": "null", "name": "p100", "inputs": []}, {"op": "null", "name": "p101", "inputs": []}, {"op": "null", "name": "p102", "inputs": []}, {"op": "null", "name": "p103", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "4269718d6b39ec58", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "out_layout": "", "flatten_data": "0"}, "inputs": [[24, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_111", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "264e358d1dbf32bc", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[30, 0, 0]]}, {"op": "null", "name": "p104", "inputs": []}, {"op": "null", "name": "p105", "inputs": []}, {"op": "null", "name": "p106", "inputs": []}, {"op": "null", "name": "p107", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_7", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "8cb240c20c9a61e5", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_7", "out_layout": "", "flatten_data": "0"}, "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0]]}, {"op": "null", "name": "p108", "inputs": []}, {"op": "null", "name": "p109", "inputs": []}, {"op": "null", "name": "p110", "inputs": []}, {"op": "null", "name": "p111", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "45b7a4dc4ca13e2f", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "out_layout": "", "flatten_data": "0"}, "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 4, 7, 8, 9, 10, 14, 15, 16, 17, 20, 21, 22, 23, 26, 27, 28, 29, 32, 33, 34, 35, 37, 38, 39, 40], "heads": [[25, 0, 0], [41, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 6, 11, 12, 13, 14, 15, 16, 11, 17, 18, 19, 20, 21, 22, 129, 130, 131, 132, 124, 21, 133, 134, 135, 136, 137, 138, 139, 140, 141, 21]], "shape": ["list_shape", [[1, 3, 256, 256], [64, 3, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 128, 128], [1, 64, 128, 128], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [1, 32, 128, 128], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [1, 32, 64, 64], [64, 32, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42], "extra": {"inputs": [0], "outputs": [25, 171]}}