{"nodes": [{"op": "null", "name": "input_174", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1e4cb4ae3537446b", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_11", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_201", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "5ec704c32d6894f0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__6", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_62", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "124e1fbf92ab5a82", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p112", "inputs": []}, {"op": "null", "name": "p113", "inputs": []}, {"op": "null", "name": "p114", "inputs": []}, {"op": "null", "name": "p115", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p116", "inputs": []}, {"op": "null", "name": "p117", "inputs": []}, {"op": "null", "name": "p118", "inputs": []}, {"op": "null", "name": "p119", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "6be3dd27938895d6", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_111", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "264e358d1dbf32bc", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[1, 0, 0]]}, {"op": "null", "name": "p132", "inputs": []}, {"op": "null", "name": "p133", "inputs": []}, {"op": "null", "name": "p134", "inputs": []}, {"op": "null", "name": "p135", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_13", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "90bc26627c740592", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_13", "out_layout": "", "flatten_data": "0"}, "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_63", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "124e1fbf92ab5a82", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[18, 0, 0]]}, {"op": "null", "name": "p136", "inputs": []}, {"op": "null", "name": "p137", "inputs": []}, {"op": "null", "name": "p138", "inputs": []}, {"op": "null", "name": "p139", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_81", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]}, {"op": "null", "name": "p140", "inputs": []}, {"op": "null", "name": "p141", "inputs": []}, {"op": "null", "name": "p142", "inputs": []}, {"op": "null", "name": "p143", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__7", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "b92e0b044f16c90b", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__7", "out_layout": "", "flatten_data": "0"}, "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "1fecd4308893ae70", "func_name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast"}, "inputs": [[12, 0, 0], [29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_17", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0eeb09c7bc47731a", "func_name": "tvmgen_default_fused_cast_divide_17"}, "inputs": [[30, 0, 0]]}, {"op": "null", "name": "p144", "inputs": []}, {"op": "null", "name": "p145", "inputs": []}, {"op": "null", "name": "p146", "inputs": []}, {"op": "null", "name": "p147", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_14", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "933b024926221b95", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_14", "out_layout": "", "flatten_data": "0"}, "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_18", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "c93fa187c25fefed", "func_name": "tvmgen_default_fused_cast_divide_18"}, "inputs": [[36, 0, 0]]}, {"op": "null", "name": "p148", "inputs": []}, {"op": "null", "name": "p149", "inputs": []}, {"op": "null", "name": "p150", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1b36144dd31325ea", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0]]}, {"op": "null", "name": "p151", "inputs": []}, {"op": "null", "name": "p152", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0fa0a8b1c1fd95be", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]}], "arg_nodes": [0, 1, 3, 4, 5, 6, 8, 9, 10, 11, 14, 15, 16, 17, 20, 21, 22, 23, 25, 26, 27, 28, 32, 33, 34, 35, 38, 39, 40, 42, 43], "heads": [[44, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [143, 148, 11, 144, 145, 146, 147, 148, 149, 150, 151, 152, 11, 32, 166, 167, 168, 169, 170, 32, 171, 172, 173, 174, 175, 176, 177, 178, 179, 32, 175, 180, 181, 182, 183, 184, 185, 180, 186, 187, 188, 189, 190, 191, 192]], "shape": ["list_shape", [[1, 128, 128, 128], [1, 64, 128, 128], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 128, 128], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 192, 256, 256], [1, 192, 256, 256], [256, 192, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [1, 256, 256, 256], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [1, 256, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45], "extra": {"inputs": [174, 201], "outputs": [233]}}