{"nodes": [{"op": "null", "name": "input_39", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "4ba6f5c8c6fab113", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "e6bfeebc80586a99", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]}, {"op": "null", "name": "p31", "inputs": []}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "eafc8eab6d4cdfe4", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0e505f02fbbc64e4", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0]]}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "null", "name": "p40", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu_1", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "d0d419c069d2d0d9", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_add_nn_leaky_relu_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "fc2ce70066fe93b0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5", "out_layout": "", "flatten_data": "0"}, "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0]]}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "5", "out_layout": "", "kernel_layout": "OIHW", "hash": "a8ab9ca42e1e5be4", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "124e1fbf92ab5a82", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[26, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_3", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "101671e5f706ed74", "func_name": "tvmgen_default_fused_nn_max_pool2d_3", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[27, 0, 0]]}, {"op": "null", "name": "p48", "inputs": []}, {"op": "null", "name": "p49", "inputs": []}, {"op": "null", "name": "p50", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "bb81fae1932409c4", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6", "out_layout": "", "flatten_data": "0"}, "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0]]}, {"op": "null", "name": "p51", "inputs": []}, {"op": "null", "name": "p52", "inputs": []}, {"op": "null", "name": "p53", "inputs": []}, {"op": "null", "name": "p54", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "c1fe77ae81bafcc5", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "67262316d98e1e1f", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[37, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_4", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "6cf9d9884889295b", "func_name": "tvmgen_default_fused_nn_max_pool2d_4", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[38, 0, 0]]}, {"op": "null", "name": "p55", "inputs": []}, {"op": "null", "name": "p56", "inputs": []}, {"op": "null", "name": "p57", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "dec16ca09bbf0bf0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "out_layout": "", "flatten_data": "0"}, "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 0]]}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "fc3304c37c41d228", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "b625d4075e500039", "func_name": "tvmgen_default_fused_cast_divide_2"}, "inputs": [[48, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_5", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "00a5e85c638e5217", "func_name": "tvmgen_default_fused_nn_max_pool2d_5", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[49, 0, 0]]}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "null", "name": "p64", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "5debef7d4c0ec709", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0]]}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "null", "name": "p68", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "b662759e5f655fca", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_5", "out_layout": "", "flatten_data": "0"}, "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0]]}, {"op": "null", "name": "p69", "inputs": []}, {"op": "null", "name": "p70", "inputs": []}, {"op": "null", "name": "p71", "inputs": []}, {"op": "null", "name": "p72", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "e7ab89f60ff3a977", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "94104aea6df6c0a1", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast"}, "inputs": [[64, 0, 0], [49, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "752b8e789ec6e168", "func_name": "tvmgen_default_fused_cast_divide_3"}, "inputs": [[65, 0, 0]]}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "null", "name": "p75", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_9", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f69df5e40ca46651", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_9", "out_layout": "", "flatten_data": "0"}, "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0]]}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f8da97555bd7b4bd", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_6", "out_layout": "", "flatten_data": "0"}, "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 0]]}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "1d308a22b335e77b", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "4dafcebcf915f055", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_1"}, "inputs": [[80, 0, 0], [38, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_4", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "381655eee4838c50", "func_name": "tvmgen_default_fused_cast_divide_4"}, "inputs": [[81, 0, 0]]}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "null", "name": "p86", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_10", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "baf7829679a87ff2", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_10", "out_layout": "", "flatten_data": "0"}, "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 0]]}, {"op": "null", "name": "p87", "inputs": []}, {"op": "null", "name": "p88", "inputs": []}, {"op": "null", "name": "p89", "inputs": []}, {"op": "null", "name": "p90", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_7", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "67b92c04ebdb3941", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_7", "out_layout": "", "flatten_data": "0"}, "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]}, {"op": "null", "name": "p91", "inputs": []}, {"op": "null", "name": "p92", "inputs": []}, {"op": "null", "name": "p93", "inputs": []}, {"op": "null", "name": "p94", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "22fb79a98a07fc11", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "f156b15efb355d58", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2"}, "inputs": [[96, 0, 0], [27, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "07813549b8c4f156", "func_name": "tvmgen_default_fused_cast_divide_5"}, "inputs": [[97, 0, 0]]}, {"op": "null", "name": "p95", "inputs": []}, {"op": "null", "name": "p96", "inputs": []}, {"op": "null", "name": "p97", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_11", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "30ea7236af4f2f56", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_11", "out_layout": "", "flatten_data": "0"}, "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 0]]}, {"op": "null", "name": "p98", "inputs": []}, {"op": "null", "name": "p99", "inputs": []}, {"op": "null", "name": "p100", "inputs": []}, {"op": "null", "name": "p101", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 5, 6, 7, 9, 10, 11, 12, 14, 15, 16, 18, 19, 20, 22, 23, 24, 25, 29, 30, 31, 33, 34, 35, 36, 40, 41, 42, 44, 45, 46, 47, 51, 52, 53, 55, 56, 57, 58, 60, 61, 62, 63, 67, 68, 69, 71, 72, 73, 74, 76, 77, 78, 79, 83, 84, 85, 87, 88, 89, 90, 92, 93, 94, 95, 99, 100, 101, 103, 104, 105, 106], "heads": [[107, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [21, 34, 35, 36, 29, 37, 38, 39, 21, 40, 41, 42, 43, 29, 44, 45, 46, 9, 47, 48, 49, 4, 50, 51, 52, 53, 9, 4, 29, 54, 55, 56, 21, 57, 58, 59, 60, 29, 21, 61, 62, 63, 64, 65, 66, 67, 68, 69, 61, 65, 70, 71, 72, 73, 74, 75, 76, 77, 78, 70, 79, 80, 81, 82, 74, 70, 65, 83, 84, 85, 74, 86, 87, 88, 89, 65, 90, 91, 92, 93, 74, 65, 21, 94, 95, 96, 74, 97, 98, 99, 100, 65, 101, 102, 103, 104, 21, 74, 4, 105, 106, 107, 21, 108, 109, 110, 111, 4]], "shape": ["list_shape", [[1, 16, 32, 32], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 64, 64], [32, 16, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [128, 32, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [1, 128, 128, 128], [1, 128, 64, 64], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [1, 256, 64, 64], [1, 256, 32, 32], [512, 256, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [512, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [1, 512, 32, 32], [1, 512, 16, 16], [1024, 512, 3, 3], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 16, 16], [1024, 1024, 3, 3], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 16, 16], [1024, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [1, 1024, 32, 32], [1, 1024, 32, 32], [512, 1024, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [512, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [512, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [1, 512, 64, 64], [1, 512, 64, 64], [256, 512, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [256, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [1, 256, 128, 128], [1, 256, 128, 128], [128, 256, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108], "extra": {"inputs": [39], "outputs": [146]}}