{"nodes": [{"op": "null", "name": "input_121", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_131", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "7535f18c8a0b8684", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_5", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "null", "name": "p86", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "90265124936940e1", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[0, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "null", "name": "p91", "inputs": []}, {"op": "null", "name": "p92", "inputs": []}, {"op": "null", "name": "p93", "inputs": []}, {"op": "null", "name": "p94", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "67f93fb298c56451", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_6", "out_layout": "", "flatten_data": "0"}, "inputs": [[1, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "e8be31553d65e992", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3"}, "inputs": [[6, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0eeb09c7bc47731a", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[12, 0, 0]]}, {"op": "null", "name": "p95", "inputs": []}, {"op": "null", "name": "p96", "inputs": []}, {"op": "null", "name": "p97", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "9e6d384c311d76dc", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}, {"op": "null", "name": "p98", "inputs": []}, {"op": "null", "name": "p99", "inputs": []}, {"op": "null", "name": "p100", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1b36144dd31325ea", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0]]}, {"op": "null", "name": "p101", "inputs": []}, {"op": "null", "name": "p102", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0fa0a8b1c1fd95be", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 4, 5, 7, 8, 9, 10, 14, 15, 16, 18, 19, 20, 22, 23], "heads": [[24, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [9, 46, 93, 94, 95, 96, 24, 101, 102, 103, 104, 9, 46, 9, 105, 106, 107, 24, 108, 109, 110, 9, 111, 112, 19]], "shape": ["list_shape", [[1, 128, 128, 128], [1, 64, 128, 128], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [64, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 192, 256, 256], [1, 192, 256, 256], [256, 192, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [1, 256, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25], "extra": {"inputs": [121, 131], "outputs": [149]}}