{"nodes": [{"op": "null", "name": "input_107", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "cb6709becb526087", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0139745e8504b7d9", "func_name": "tvmgen_default_fused_cast_divide_7"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p72", "inputs": []}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a957a132f0924952", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]}, {"op": "null", "name": "p75", "inputs": []}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "77de8dba2b8736c1", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a8d52321c749ea24", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 6, 7, 8, 10, 11], "heads": [[12, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [14, 4, 83, 84, 85, 23, 86, 87, 88, 14, 89, 90, 37]], "shape": ["list_shape", [[1, 128, 256, 256], [1, 128, 256, 256], [64, 128, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "extra": {"inputs": [107], "outputs": [119]}}