{"nodes": [{"op": "null", "name": "input_39", "attrs": {"num_outputs": "1", "num_inputs": "5", "out_layout": "", "kernel_layout": "OIHW", "hash": "f8da97555bd7b4bd", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_3", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "00a5e85c638e5217", "func_name": "tvmgen_default_fused_nn_max_pool2d_3", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "5debef7d4c0ec709", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]}, {"op": "null", "name": "p31", "inputs": []}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "b662759e5f655fca", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0]]}, {"op": "null", "name": "p35", "inputs": []}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "e7ab89f60ff3a977", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "959ced0b6372f5f8", "func_name": "tvmgen_default_fused_concatenate"}, "inputs": [[15, 0, 0], [0, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 6, 7, 8, 9, 11, 12, 13, 14], "heads": [[16, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [21, 29, 34, 35, 36, 37, 38, 39, 40, 41, 29, 42, 43, 44, 45, 37, 29]], "shape": ["list_shape", [[1, 512, 32, 32], [1, 512, 16, 16], [1024, 512, 3, 3], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 16, 16], [1024, 1024, 3, 3], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 16, 16], [1024, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [1, 1024, 32, 32]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], "extra": {"inputs": [39], "outputs": [55]}}