{"nodes": [{"op": "null", "name": "input_41", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "d86d37fff6b9fe04", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "eef8dacc5d543f0d", "func_name": "tvmgen_default_fused_cast_divide_5"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "9bb6f1f76462f5a2", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "b625d4075e500039", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[6, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "null", "name": "p31", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "fc3304c37c41d228", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "b625d4075e500039", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[12, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "0b1be94b10a46498", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[13, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "420693980bab160a", "func_name": "tvmgen_default_fused_cast_divide_7"}, "inputs": [[14, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1889b27198337995", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_8", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0c765cca72133e71", "func_name": "tvmgen_default_fused_cast_divide_8"}, "inputs": [[20, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "b662759e5f655fca", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0]]}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "13a6685da579890f", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "out_layout": "", "flatten_data": "0"}, "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "0f6ecf1948dde699", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast"}, "inputs": [[31, 0, 0], [13, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5, 8, 9, 10, 11, 16, 17, 18, 19, 22, 23, 24, 25, 27, 28, 29, 30], "heads": [[32, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [36, 37, 38, 39, 40, 41, 42, 37, 43, 44, 45, 46, 47, 37, 48, 49, 50, 51, 52, 53, 54, 49, 55, 56, 57, 58, 59, 60, 61, 62, 63, 49, 59]], "shape": ["list_shape", [[1, 256, 32, 32], [1, 256, 32, 32], [512, 256, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [1, 512, 32, 32], [512, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [1, 512, 32, 32], [1, 512, 16, 16], [1, 512, 16, 16], [1024, 512, 3, 3], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 16, 16], [1, 1024, 16, 16], [1024, 1024, 3, 3], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 1, 1], [1, 1024, 16, 16], [1024, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [1, 1024, 32, 32]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33], "extra": {"inputs": [41], "outputs": [73]}}