{"nodes": [{"op": "null", "name": "input_9", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f14094ce170e4d7e", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_19", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_29", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "67b92c04ebdb3941", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_55", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "959ced0b6372f5f8", "func_name": "tvmgen_default_fused_concatenate"}, "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f69df5e40ca46651", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5", "out_layout": "", "flatten_data": "0"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_31", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f8da97555bd7b4bd", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "null", "name": "p48", "inputs": []}, {"op": "null", "name": "p49", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "1d308a22b335e77b", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_1", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "f227f8e2e0c693a0", "func_name": "tvmgen_default_fused_concatenate_1"}, "inputs": [[17, 0, 0], [2, 0, 0]]}, {"op": "null", "name": "p50", "inputs": []}, {"op": "null", "name": "p51", "inputs": []}, {"op": "null", "name": "p52", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "baf7829679a87ff2", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6", "out_layout": "", "flatten_data": "0"}, "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0]]}, {"op": "null", "name": "p53", "inputs": []}, {"op": "null", "name": "p54", "inputs": []}, {"op": "null", "name": "p55", "inputs": []}, {"op": "null", "name": "p56", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_21", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "67b92c04ebdb3941", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]}, {"op": "null", "name": "p57", "inputs": []}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "null", "name": "p60", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "22fb79a98a07fc11", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_2", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "622b977360816399", "func_name": "tvmgen_default_fused_concatenate_2"}, "inputs": [[32, 0, 0], [1, 0, 0]]}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "30ea7236af4f2f56", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "out_layout": "", "flatten_data": "0"}, "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_11", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 0]]}, {"op": "null", "name": "p68", "inputs": []}, {"op": "null", "name": "p69", "inputs": []}, {"op": "null", "name": "p70", "inputs": []}, {"op": "null", "name": "p71", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "90265124936940e1", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "43d7b7201cb1af81", "func_name": "tvmgen_default_fused_concatenate_3"}, "inputs": [[47, 0, 0], [0, 0, 0]]}, {"op": "null", "name": "p72", "inputs": []}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a957a132f0924952", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0]]}, {"op": "null", "name": "p75", "inputs": []}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "77de8dba2b8736c1", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 0]]}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a8d52321c749ea24", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 13, 14, 15, 16, 19, 20, 21, 23, 24, 25, 26, 28, 29, 30, 31, 34, 35, 36, 38, 39, 40, 41, 43, 44, 45, 46, 49, 50, 51, 53, 54, 55, 57, 58], "heads": [[59, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [9, 4, 13, 29, 46, 47, 48, 37, 49, 50, 51, 52, 53, 54, 55, 56, 57, 37, 53, 58, 59, 60, 37, 61, 62, 63, 64, 65, 66, 67, 68, 69, 37, 65, 70, 71, 72, 37, 73, 74, 75, 76, 77, 78, 79, 80, 81, 37, 77, 82, 83, 84, 37, 85, 86, 87, 88, 89, 90, 91]], "shape": ["list_shape", [[1, 64, 256, 256], [1, 128, 128, 128], [1, 256, 64, 64], [1, 1024, 32, 32], [512, 1024, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [512, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 32, 32], [512, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [1, 512, 64, 64], [256, 512, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 64, 64], [256, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [1, 256, 128, 128], [128, 256, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 128, 256, 256], [64, 128, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60], "extra": {"inputs": [9, 19, 29, 55], "outputs": [111]}}