{"nodes": [{"op": "null", "name": "input_128", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1e4cb4ae3537446b", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_144", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "87d10f50f2a3fc47", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_42", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "124e1fbf92ab5a82", "func_name": "tvmgen_default_fused_cast_divide_4"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "null", "name": "p86", "inputs": []}, {"op": "null", "name": "p87", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "6be3dd27938895d6", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__4", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "6288529d5bd6627e", "func_name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast"}, "inputs": [[12, 0, 0], [1, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_14", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0139745e8504b7d9", "func_name": "tvmgen_default_fused_cast_divide_14"}, "inputs": [[13, 0, 0]]}, {"op": "null", "name": "p92", "inputs": []}, {"op": "null", "name": "p93", "inputs": []}, {"op": "null", "name": "p94", "inputs": []}, {"op": "null", "name": "p95", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_9", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "2e9c4732a2a9d6df", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_9", "out_layout": "", "flatten_data": "0"}, "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_141", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0139745e8504b7d9", "func_name": "tvmgen_default_fused_cast_divide_14"}, "inputs": [[19, 0, 0]]}, {"op": "null", "name": "p96", "inputs": []}, {"op": "null", "name": "p97", "inputs": []}, {"op": "null", "name": "p98", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "103c85ec2e9a1610", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]}, {"op": "null", "name": "p99", "inputs": []}, {"op": "null", "name": "p100", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "f730448a8f07b332", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]}], "arg_nodes": [0, 1, 3, 4, 5, 6, 8, 9, 10, 11, 15, 16, 17, 18, 21, 22, 23, 25, 26], "heads": [[27, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [106, 111, 18, 107, 108, 109, 110, 111, 112, 113, 114, 115, 18, 11, 120, 121, 122, 123, 124, 125, 120, 126, 127, 128, 129, 130, 131, 132]], "shape": ["list_shape", [[1, 128, 128, 128], [1, 64, 256, 256], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 128, 256, 256], [1, 128, 256, 256], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 128, 256, 256], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 128, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28], "extra": {"inputs": [128, 144], "outputs": [159]}}