{"nodes": [{"op": "null", "name": "input_19", "attrs": {"num_outputs": "1", "num_inputs": "5", "out_layout": "", "kernel_layout": "OIHW", "hash": "2469213505852f4a", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "8d9857381559bffe", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "8d9857381559bffe", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_1", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "0b8f56d6e185e11a", "func_name": "tvmgen_default_fused_nn_max_pool2d_1", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[2, 0, 0]]}, {"op": "null", "name": "p14", "inputs": []}, {"op": "null", "name": "p15", "inputs": []}, {"op": "null", "name": "p16", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a35b129c7b6cd35e", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p17", "inputs": []}, {"op": "null", "name": "p18", "inputs": []}, {"op": "null", "name": "p19", "inputs": []}, {"op": "null", "name": "p20", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a0ac3590ea32e11c", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "2671da4b32d0b376", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[12, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_2", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "006aac33b2422393", "func_name": "tvmgen_default_fused_nn_max_pool2d_2", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[13, 0, 0]]}, {"op": "null", "name": "p21", "inputs": []}, {"op": "null", "name": "p22", "inputs": []}, {"op": "null", "name": "p23", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "b589678ba605f85d", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "cb797ac78982211b", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "61936ac1605612d0", "func_name": "tvmgen_default_fused_cast_divide_2"}, "inputs": [[23, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_3", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "90294f5c278e8890", "func_name": "tvmgen_default_fused_nn_max_pool2d_3", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[24, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a51899339a3fc351", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0]]}, {"op": "null", "name": "p31", "inputs": []}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "dac70adb50319a60", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0615b8b7451279fa", "func_name": "tvmgen_default_fused_cast_divide_3"}, "inputs": [[34, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_4", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "6bc537366576f9ac", "func_name": "tvmgen_default_fused_nn_max_pool2d_4", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[35, 0, 0]]}, {"op": "null", "name": "p35", "inputs": []}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0d40c4a8e2693b9b", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5", "out_layout": "", "flatten_data": "0"}, "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0]]}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0ec8ea53323afe9e", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0]]}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "bae00022c93d6498", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", "out_layout": "", "flatten_data": "0"}, "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "45ae86297e22192a", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast"}, "inputs": [[50, 0, 0], [35, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_4", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "420693980bab160a", "func_name": "tvmgen_default_fused_cast_divide_4"}, "inputs": [[51, 0, 0]]}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "null", "name": "p48", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "66a7bb62e36af87d", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6", "out_layout": "", "flatten_data": "0"}, "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 0]]}, {"op": "null", "name": "p49", "inputs": []}, {"op": "null", "name": "p50", "inputs": []}, {"op": "null", "name": "p51", "inputs": []}, {"op": "null", "name": "p52", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a30d144553788275", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 0]]}, {"op": "null", "name": "p53", "inputs": []}, {"op": "null", "name": "p54", "inputs": []}, {"op": "null", "name": "p55", "inputs": []}, {"op": "null", "name": "p56", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "eb2adb736af11d56", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", "out_layout": "", "flatten_data": "0"}, "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "aaa580d06e063b87", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_1"}, "inputs": [[66, 0, 0], [24, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "eef8dacc5d543f0d", "func_name": "tvmgen_default_fused_cast_divide_5"}, "inputs": [[67, 0, 0]]}, {"op": "null", "name": "p57", "inputs": []}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "92a55bafbe111770", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "out_layout": "", "flatten_data": "0"}, "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 0]]}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1e46325e086a6e13", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "bdc1a283298a5e33", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", "out_layout": "", "flatten_data": "0"}, "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "d52f711169a71199", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2"}, "inputs": [[82, 0, 0], [13, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "6bd59b3449230bf3", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[83, 0, 0]]}, {"op": "null", "name": "p68", "inputs": []}, {"op": "null", "name": "p69", "inputs": []}, {"op": "null", "name": "p70", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "a525390ee0d423d5", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 0]]}, {"op": "null", "name": "p71", "inputs": []}, {"op": "null", "name": "p72", "inputs": []}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "c09ba6cc46ab4e84", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 0]]}, {"op": "null", "name": "p75", "inputs": []}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "null", "name": "p78", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "c1464e804198c7fb", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "out_layout": "", "flatten_data": "0"}, "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "819b4f1448703a97", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3"}, "inputs": [[98, 0, 0], [2, 0, 0]]}], "arg_nodes": [0, 4, 5, 6, 8, 9, 10, 11, 15, 16, 17, 19, 20, 21, 22, 26, 27, 28, 30, 31, 32, 33, 37, 38, 39, 41, 42, 43, 44, 46, 47, 48, 49, 53, 54, 55, 57, 58, 59, 60, 62, 63, 64, 65, 69, 70, 71, 73, 74, 75, 76, 78, 79, 80, 81, 85, 86, 87, 89, 90, 91, 92, 94, 95, 96, 97], "heads": [[99, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [17, 4, 4, 18, 19, 20, 21, 9, 22, 23, 24, 25, 18, 9, 26, 27, 28, 29, 30, 31, 32, 33, 34, 26, 30, 35, 36, 37, 38, 39, 40, 41, 42, 43, 35, 39, 44, 45, 46, 47, 48, 49, 50, 51, 52, 44, 53, 54, 55, 56, 48, 44, 39, 57, 58, 59, 48, 60, 61, 62, 63, 39, 64, 65, 66, 67, 48, 39, 30, 68, 69, 70, 48, 71, 72, 73, 74, 39, 75, 76, 77, 78, 30, 48, 9, 79, 80, 81, 30, 82, 83, 84, 85, 9, 86, 87, 88, 89, 30, 9]], "shape": ["list_shape", [[1, 32, 128, 128], [1, 32, 128, 128], [1, 32, 128, 128], [1, 32, 64, 64], [64, 32, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 64, 64], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 64, 64], [1, 64, 64, 64], [1, 64, 32, 32], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 32, 32], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 32, 32], [1, 128, 32, 32], [1, 128, 16, 16], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 16, 16], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 16, 16], [1, 256, 16, 16], [1, 256, 8, 8], [512, 256, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 8, 8], [512, 512, 3, 3], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 1, 1], [1, 512, 8, 8], [512, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 16, 16], [1, 512, 16, 16], [1, 512, 16, 16], [256, 512, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 16, 16], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 16, 16], [256, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 32, 32], [1, 256, 32, 32], [1, 256, 32, 32], [128, 256, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 32, 32], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 32, 32], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 64, 64], [1, 128, 64, 64], [1, 128, 64, 64], [64, 128, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 64, 64], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 64, 64], [64, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [1, 64, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100], "extra": {"inputs": [19], "outputs": [117]}}