{"nodes": [{"op": "null", "name": "input_142", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1e4cb4ae3537446b", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_9", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "null", "name": "input_158", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "27299562959cfefe", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__6", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_62", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "124e1fbf92ab5a82", "func_name": "tvmgen_default_fused_cast_divide_6"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p88", "inputs": []}, {"op": "null", "name": "p89", "inputs": []}, {"op": "null", "name": "p90", "inputs": []}, {"op": "null", "name": "p91", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "efe980a7db7571fe", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_4", "out_layout": "", "flatten_data": "0"}, "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p92", "inputs": []}, {"op": "null", "name": "p93", "inputs": []}, {"op": "null", "name": "p94", "inputs": []}, {"op": "null", "name": "p95", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "6be3dd27938895d6", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__5", "out_layout": "", "flatten_data": "0"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_111", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "264e358d1dbf32bc", "func_name": "tvmgen_default_fused_cast_divide_1"}, "inputs": [[1, 0, 0]]}, {"op": "null", "name": "p100", "inputs": []}, {"op": "null", "name": "p101", "inputs": []}, {"op": "null", "name": "p102", "inputs": []}, {"op": "null", "name": "p103", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__7", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "IOHW", "hash": "f5f8c7f6a15798ec", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__7", "out_layout": "", "flatten_data": "0"}, "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "hash": "1fecd4308893ae70", "func_name": "tvmgen_default_fused_cast_divide_cast_divide_concatenate_multiply_round_clip_cast"}, "inputs": [[12, 0, 0], [18, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_16", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "0eeb09c7bc47731a", "func_name": "tvmgen_default_fused_cast_divide_16"}, "inputs": [[19, 0, 0]]}, {"op": "null", "name": "p104", "inputs": []}, {"op": "null", "name": "p105", "inputs": []}, {"op": "null", "name": "p106", "inputs": []}, {"op": "null", "name": "p107", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "933b024926221b95", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "out_layout": "", "flatten_data": "0"}, "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_17", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "c93fa187c25fefed", "func_name": "tvmgen_default_fused_cast_divide_17"}, "inputs": [[25, 0, 0]]}, {"op": "null", "name": "p108", "inputs": []}, {"op": "null", "name": "p109", "inputs": []}, {"op": "null", "name": "p110", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "1b36144dd31325ea", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0]]}, {"op": "null", "name": "p111", "inputs": []}, {"op": "null", "name": "p112", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "0fa0a8b1c1fd95be", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "flatten_data": "0"}, "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]}], "arg_nodes": [0, 1, 3, 4, 5, 6, 8, 9, 10, 11, 14, 15, 16, 17, 21, 22, 23, 24, 27, 28, 29, 31, 32], "heads": [[33, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [117, 122, 11, 118, 119, 120, 121, 122, 123, 124, 125, 126, 11, 18, 131, 132, 133, 134, 135, 18, 136, 137, 138, 139, 140, 141, 136, 142, 143, 144, 145, 146, 147, 148]], "shape": ["list_shape", [[1, 128, 128, 128], [1, 64, 128, 128], [1, 128, 128, 128], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 128, 128], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 128, 128], [64, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 256, 256], [1, 192, 256, 256], [1, 192, 256, 256], [256, 192, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [1, 256, 256, 256], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 256, 256], [1, 256, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34], "extra": {"inputs": [142, 158], "outputs": [179]}}