{
    "nodes": [
        {
            "op": "null",
            "name": "input_9",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "c35c41a655f8a1a2"
            },
            "inputs": []
        },
        {
            "op": "null",
            "name": "input_20",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "cbf82f11f3177c85"
            },
            "inputs": []
        },
        {
            "op": "null",
            "name": "input_31",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0fc1d36e3a42d9cc"
            },
            "inputs": []
        },
        {
            "op": "null",
            "name": "input_42",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0cf191d346f9c157"
            },
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide",
                "hash": "85165d63e18469f5"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_1",
                "hash": "636a5321792fc858"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_2",
                "hash": "264e358d1dbf32bc"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_3",
                "hash": "6bd59b3449230bf3"
            },
            "inputs": [
                [
                    3,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_3",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "8f41a8f1878e35e5"
            },
            "inputs": [
                [
                    7,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p28",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p29",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p30",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "507c2c1b845a6d33"
            },
            "inputs": [
                [
                    8,
                    0,
                    0
                ],
                [
                    9,
                    0,
                    0
                ],
                [
                    10,
                    0,
                    0
                ],
                [
                    11,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p31",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p32",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p33",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p34",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "8f709a2d2851a3c9"
            },
            "inputs": [
                [
                    12,
                    0,
                    0
                ],
                [
                    13,
                    0,
                    0
                ],
                [
                    14,
                    0,
                    0
                ],
                [
                    15,
                    0,
                    0
                ],
                [
                    16,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p35",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p36",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p37",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p38",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "2b546a346317a518"
            },
            "inputs": [
                [
                    17,
                    0,
                    0
                ],
                [
                    18,
                    0,
                    0
                ],
                [
                    19,
                    0,
                    0
                ],
                [
                    20,
                    0,
                    0
                ],
                [
                    21,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate",
                "hash": "a0cd721541e9f7e5"
            },
            "inputs": [
                [
                    22,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p39",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p40",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p41",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "02e6e84308b7771f"
            },
            "inputs": [
                [
                    23,
                    0,
                    0
                ],
                [
                    24,
                    0,
                    0
                ],
                [
                    25,
                    0,
                    0
                ],
                [
                    26,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p42",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p43",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p44",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p45",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "eef4cb8b0b95c0f6"
            },
            "inputs": [
                [
                    27,
                    0,
                    0
                ],
                [
                    28,
                    0,
                    0
                ],
                [
                    29,
                    0,
                    0
                ],
                [
                    30,
                    0,
                    0
                ],
                [
                    31,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p46",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p47",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p48",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p49",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "7c3bb1d0f4348302"
            },
            "inputs": [
                [
                    32,
                    0,
                    0
                ],
                [
                    33,
                    0,
                    0
                ],
                [
                    34,
                    0,
                    0
                ],
                [
                    35,
                    0,
                    0
                ],
                [
                    36,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_1",
                "hash": "3a8a880cc13869bd"
            },
            "inputs": [
                [
                    37,
                    0,
                    0
                ],
                [
                    6,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p50",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p51",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p52",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "7be6ecb9f8d28f4d"
            },
            "inputs": [
                [
                    38,
                    0,
                    0
                ],
                [
                    39,
                    0,
                    0
                ],
                [
                    40,
                    0,
                    0
                ],
                [
                    41,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p53",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p54",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p55",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p56",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "8cb240c20c9a61e5"
            },
            "inputs": [
                [
                    42,
                    0,
                    0
                ],
                [
                    43,
                    0,
                    0
                ],
                [
                    44,
                    0,
                    0
                ],
                [
                    45,
                    0,
                    0
                ],
                [
                    46,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p57",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p58",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p59",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p60",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "a19d4dacf72f18f3"
            },
            "inputs": [
                [
                    47,
                    0,
                    0
                ],
                [
                    48,
                    0,
                    0
                ],
                [
                    49,
                    0,
                    0
                ],
                [
                    50,
                    0,
                    0
                ],
                [
                    51,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_2",
                "hash": "0d688a8f5e75b65e"
            },
            "inputs": [
                [
                    52,
                    0,
                    0
                ],
                [
                    5,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p61",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p62",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p63",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "f81b264d19b9a6be"
            },
            "inputs": [
                [
                    53,
                    0,
                    0
                ],
                [
                    54,
                    0,
                    0
                ],
                [
                    55,
                    0,
                    0
                ],
                [
                    56,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p64",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p65",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p66",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p67",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "afcc3e3243b199b7"
            },
            "inputs": [
                [
                    57,
                    0,
                    0
                ],
                [
                    58,
                    0,
                    0
                ],
                [
                    59,
                    0,
                    0
                ],
                [
                    60,
                    0,
                    0
                ],
                [
                    61,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p68",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p69",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p70",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p71",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "e2fccacfae4878e3"
            },
            "inputs": [
                [
                    62,
                    0,
                    0
                ],
                [
                    63,
                    0,
                    0
                ],
                [
                    64,
                    0,
                    0
                ],
                [
                    65,
                    0,
                    0
                ],
                [
                    66,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_3",
                "hash": "88c150325a68c3fc"
            },
            "inputs": [
                [
                    67,
                    0,
                    0
                ],
                [
                    4,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p72",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p73",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p74",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0258e262c093a80d"
            },
            "inputs": [
                [
                    68,
                    0,
                    0
                ],
                [
                    69,
                    0,
                    0
                ],
                [
                    70,
                    0,
                    0
                ],
                [
                    71,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p75",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p76",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p77",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "b83cfcda2b3569ee"
            },
            "inputs": [
                [
                    72,
                    0,
                    0
                ],
                [
                    73,
                    0,
                    0
                ],
                [
                    74,
                    0,
                    0
                ],
                [
                    75,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p78",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p79",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "3",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "61cdf1c6242552b1"
            },
            "inputs": [
                [
                    76,
                    0,
                    0
                ],
                [
                    77,
                    0,
                    0
                ],
                [
                    78,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        2,
        3,
        9,
        10,
        11,
        13,
        14,
        15,
        16,
        18,
        19,
        20,
        21,
        24,
        25,
        26,
        28,
        29,
        30,
        31,
        33,
        34,
        35,
        36,
        39,
        40,
        41,
        43,
        44,
        45,
        46,
        48,
        49,
        50,
        51,
        54,
        55,
        56,
        58,
        59,
        60,
        61,
        63,
        64,
        65,
        66,
        69,
        70,
        71,
        73,
        74,
        75,
        77,
        78
    ],
    "heads": [
        [
            79,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "int8",
                "int8",
                "int8",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                9,
                10,
                19,
                28,
                4,
                14,
                23,
                32,
                37,
                38,
                39,
                40,
                41,
                42,
                43,
                44,
                45,
                37,
                46,
                47,
                48,
                49,
                41,
                37,
                50,
                51,
                52,
                41,
                53,
                54,
                55,
                56,
                32,
                57,
                58,
                59,
                60,
                37,
                32,
                61,
                62,
                63,
                37,
                64,
                65,
                66,
                67,
                23,
                68,
                69,
                70,
                71,
                32,
                23,
                72,
                73,
                74,
                32,
                75,
                76,
                77,
                78,
                14,
                79,
                80,
                81,
                82,
                23,
                14,
                83,
                84,
                85,
                23,
                86,
                87,
                88,
                4,
                89,
                90,
                41
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    1,
                    64,
                    128,
                    128
                ],
                [
                    1,
                    128,
                    64,
                    64
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    1,
                    64,
                    128,
                    128
                ],
                [
                    1,
                    128,
                    64,
                    64
                ],
                [
                    1,
                    128,
                    32,
                    32
                ],
                [
                    256,
                    128,
                    3,
                    3
                ],
                [
                    1,
                    256,
                    1,
                    1
                ],
                [
                    1,
                    256,
                    1,
                    1
                ],
                [
                    1,
                    256,
                    32,
                    32
                ],
                [
                    256,
                    256,
                    3,
                    3
                ],
                [
                    1,
                    256,
                    1,
                    1
                ],
                [
                    1,
                    256,
                    1,
                    1
                ],
                [
                    1,
                    256,
                    1,
                    1
                ],
                [
                    1,
                    256,
                    32,
                    32
                ],
                [
                    256,
                    128,
                    3,
                    3
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    64,
                    64
                ],
                [
                    1,
                    256,
                    64,
                    64
                ],
                [
                    128,
                    256,
                    3,
                    3
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    64,
                    64
                ],
                [
                    128,
                    128,
                    3,
                    3
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    1,
                    1
                ],
                [
                    1,
                    128,
                    64,
                    64
                ],
                [
                    128,
                    64,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    128,
                    128
                ],
                [
                    1,
                    128,
                    128,
                    128
                ],
                [
                    64,
                    128,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    128,
                    128
                ],
                [
                    64,
                    64,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    128,
                    128
                ],
                [
                    64,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    1,
                    64,
                    256,
                    256
                ],
                [
                    32,
                    64,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    32,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    32,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    32,
                    512,
                    512
                ],
                [
                    16,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    16,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    1,
                    1
                ],
                [
                    1,
                    1,
                    512,
                    512
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38,
        39,
        40,
        41,
        42,
        43,
        44,
        45,
        46,
        47,
        48,
        49,
        50,
        51,
        52,
        53,
        54,
        55,
        56,
        57,
        58,
        59,
        60,
        61,
        62,
        63,
        64,
        65,
        66,
        67,
        68,
        69,
        70,
        71,
        72,
        73,
        74,
        75,
        76,
        77,
        78,
        79,
        80
    ],
    "extra": {
        "inputs": [
            9,
            20,
            31,
            42
        ],
        "outputs": [
            79
        ]
    }
}