{"nodes": [{"op": "null", "name": "input_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "out_layout": "", "layout": "NCHW", "hash": "4d28db8d44201a17"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_5", "hash": "2671da4b32d0b376"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "78c3689fa5a33327"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[6, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "null", "name": "p31", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "4d1da5372af05643"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[12, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "7372b946bc54379f"}, "inputs": [[13, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "61936ac1605612d0"}, "inputs": [[14, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8c258dc25c585a3c"}, "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_8", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_8", "hash": "eef8dacc5d543f0d"}, "inputs": [[20, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "ce381f97c1c6b641"}, "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0]]}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575_", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575_", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "8badd664bf26d97b"}, "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5, 8, 9, 10, 11, 16, 17, 18, 19, 22, 23, 24, 25, 27, 28, 29, 30], "heads": [[12, 0, 0], [31, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]], "storage_id": ["list_int", [36, 37, 38, 39, 40, 41, 42, 37, 43, 44, 45, 46, 47, 37, 48, 49, 50, 51, 52, 53, 54, 49, 55, 56, 57, 58, 59, 60, 61, 62, 63, 49]], "shape": ["list_shape", [[1, 64, 64, 64], [1, 64, 64, 64], [128, 64, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [1, 128, 64, 64], [128, 128, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [1, 128, 64, 64], [1, 128, 32, 32], [1, 128, 32, 32], [256, 128, 3, 3], [256], [256, 1, 1], [256, 1, 1], [1, 256, 32, 32], [1, 256, 32, 32], [256, 256, 3, 3], [256], [256, 1, 1], [256, 1, 1], [1, 256, 32, 32], [256, 128, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32], "extra": {"inputs": [41], "outputs": [53, 72]}}