{
    "nodes": [
        {
            "op": "null",
            "name": "input_0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p1",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p2",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "3dbb7c2534747700"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ],
                [
                    1,
                    0,
                    0
                ],
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p3",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p4",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p5",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p6",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "c35c41a655f8a1a2"
            },
            "inputs": [
                [
                    4,
                    0,
                    0
                ],
                [
                    5,
                    0,
                    0
                ],
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ],
                [
                    8,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide",
                "hash": "85165d63e18469f5"
            },
            "inputs": [
                [
                    9,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "9113d81e30deba46"
            },
            "inputs": [
                [
                    10,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_1",
                "hash": "db38370063b8e991"
            },
            "inputs": [
                [
                    11,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p8",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p9",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "402a583eab6e9d86"
            },
            "inputs": [
                [
                    12,
                    0,
                    0
                ],
                [
                    13,
                    0,
                    0
                ],
                [
                    14,
                    0,
                    0
                ],
                [
                    15,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p10",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p11",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p12",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p13",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "cbf82f11f3177c85"
            },
            "inputs": [
                [
                    16,
                    0,
                    0
                ],
                [
                    17,
                    0,
                    0
                ],
                [
                    18,
                    0,
                    0
                ],
                [
                    19,
                    0,
                    0
                ],
                [
                    20,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_2",
                "hash": "636a5321792fc858"
            },
            "inputs": [
                [
                    21,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "f95473e579929258"
            },
            "inputs": [
                [
                    22,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_3",
                "hash": "8d9857381559bffe"
            },
            "inputs": [
                [
                    23,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p14",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p15",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p16",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "4a7612bf260c4695"
            },
            "inputs": [
                [
                    24,
                    0,
                    0
                ],
                [
                    25,
                    0,
                    0
                ],
                [
                    26,
                    0,
                    0
                ],
                [
                    27,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p17",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p18",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p19",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p20",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0fc1d36e3a42d9cc"
            },
            "inputs": [
                [
                    28,
                    0,
                    0
                ],
                [
                    29,
                    0,
                    0
                ],
                [
                    30,
                    0,
                    0
                ],
                [
                    31,
                    0,
                    0
                ],
                [
                    32,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_4",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_4",
                "hash": "264e358d1dbf32bc"
            },
            "inputs": [
                [
                    33,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "4d28db8d44201a17"
            },
            "inputs": [
                [
                    34,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_5",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_5",
                "hash": "2671da4b32d0b376"
            },
            "inputs": [
                [
                    35,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p21",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p22",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p23",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_3",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "28c22030fbad6c26"
            },
            "inputs": [
                [
                    36,
                    0,
                    0
                ],
                [
                    37,
                    0,
                    0
                ],
                [
                    38,
                    0,
                    0
                ],
                [
                    39,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p24",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p25",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p26",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p27",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0cf191d346f9c157"
            },
            "inputs": [
                [
                    40,
                    0,
                    0
                ],
                [
                    41,
                    0,
                    0
                ],
                [
                    42,
                    0,
                    0
                ],
                [
                    43,
                    0,
                    0
                ],
                [
                    44,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_6",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_6",
                "hash": "6bd59b3449230bf3"
            },
            "inputs": [
                [
                    45,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "7372b946bc54379f"
            },
            "inputs": [
                [
                    46,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_7",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_7",
                "hash": "61936ac1605612d0"
            },
            "inputs": [
                [
                    47,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p28",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p29",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p30",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_4",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "507c2c1b845a6d33"
            },
            "inputs": [
                [
                    48,
                    0,
                    0
                ],
                [
                    49,
                    0,
                    0
                ],
                [
                    50,
                    0,
                    0
                ],
                [
                    51,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p31",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p32",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p33",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p34",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "8f709a2d2851a3c9"
            },
            "inputs": [
                [
                    52,
                    0,
                    0
                ],
                [
                    53,
                    0,
                    0
                ],
                [
                    54,
                    0,
                    0
                ],
                [
                    55,
                    0,
                    0
                ],
                [
                    56,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p35",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p36",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p37",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p38",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "2b546a346317a518"
            },
            "inputs": [
                [
                    57,
                    0,
                    0
                ],
                [
                    58,
                    0,
                    0
                ],
                [
                    59,
                    0,
                    0
                ],
                [
                    60,
                    0,
                    0
                ],
                [
                    61,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast",
                "hash": "740d1a0b8b6bbef4"
            },
            "inputs": [
                [
                    62,
                    0,
                    0
                ],
                [
                    46,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_8",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_8",
                "hash": "67262316d98e1e1f"
            },
            "inputs": [
                [
                    63,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p39",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p40",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p41",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_5",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "02e6e84308b7771f"
            },
            "inputs": [
                [
                    64,
                    0,
                    0
                ],
                [
                    65,
                    0,
                    0
                ],
                [
                    66,
                    0,
                    0
                ],
                [
                    67,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p42",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p43",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p44",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p45",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "eef4cb8b0b95c0f6"
            },
            "inputs": [
                [
                    68,
                    0,
                    0
                ],
                [
                    69,
                    0,
                    0
                ],
                [
                    70,
                    0,
                    0
                ],
                [
                    71,
                    0,
                    0
                ],
                [
                    72,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p46",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p47",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p48",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p49",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "7c3bb1d0f4348302"
            },
            "inputs": [
                [
                    73,
                    0,
                    0
                ],
                [
                    74,
                    0,
                    0
                ],
                [
                    75,
                    0,
                    0
                ],
                [
                    76,
                    0,
                    0
                ],
                [
                    77,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_1",
                "hash": "c1ea77ee130118b4"
            },
            "inputs": [
                [
                    78,
                    0,
                    0
                ],
                [
                    34,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_9",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_9",
                "hash": "124e1fbf92ab5a82"
            },
            "inputs": [
                [
                    79,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p50",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p51",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p52",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_6",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "7be6ecb9f8d28f4d"
            },
            "inputs": [
                [
                    80,
                    0,
                    0
                ],
                [
                    81,
                    0,
                    0
                ],
                [
                    82,
                    0,
                    0
                ],
                [
                    83,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p53",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p54",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p55",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p56",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "8cb240c20c9a61e5"
            },
            "inputs": [
                [
                    84,
                    0,
                    0
                ],
                [
                    85,
                    0,
                    0
                ],
                [
                    86,
                    0,
                    0
                ],
                [
                    87,
                    0,
                    0
                ],
                [
                    88,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p57",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p58",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p59",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p60",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "a19d4dacf72f18f3"
            },
            "inputs": [
                [
                    89,
                    0,
                    0
                ],
                [
                    90,
                    0,
                    0
                ],
                [
                    91,
                    0,
                    0
                ],
                [
                    92,
                    0,
                    0
                ],
                [
                    93,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2",
                "hash": "9e940466005aa1f3"
            },
            "inputs": [
                [
                    94,
                    0,
                    0
                ],
                [
                    22,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_10",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_10",
                "hash": "fa27adaace0bfe80"
            },
            "inputs": [
                [
                    95,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p61",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p62",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p63",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "f81b264d19b9a6be"
            },
            "inputs": [
                [
                    96,
                    0,
                    0
                ],
                [
                    97,
                    0,
                    0
                ],
                [
                    98,
                    0,
                    0
                ],
                [
                    99,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p64",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p65",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p66",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p67",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "afcc3e3243b199b7"
            },
            "inputs": [
                [
                    100,
                    0,
                    0
                ],
                [
                    101,
                    0,
                    0
                ],
                [
                    102,
                    0,
                    0
                ],
                [
                    103,
                    0,
                    0
                ],
                [
                    104,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p68",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p69",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p70",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p71",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3",
                "out_layout": "",
                "kernel_layout": "IOHW",
                "data_layout": "NCHW",
                "hash": "e2fccacfae4878e3"
            },
            "inputs": [
                [
                    105,
                    0,
                    0
                ],
                [
                    106,
                    0,
                    0
                ],
                [
                    107,
                    0,
                    0
                ],
                [
                    108,
                    0,
                    0
                ],
                [
                    109,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3",
                "hash": "9c8a637413505916"
            },
            "inputs": [
                [
                    110,
                    0,
                    0
                ],
                [
                    10,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_11",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_11",
                "hash": "186333aa7e215879"
            },
            "inputs": [
                [
                    111,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p72",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p73",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p74",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0258e262c093a80d"
            },
            "inputs": [
                [
                    112,
                    0,
                    0
                ],
                [
                    113,
                    0,
                    0
                ],
                [
                    114,
                    0,
                    0
                ],
                [
                    115,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p75",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p76",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p77",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "b83cfcda2b3569ee"
            },
            "inputs": [
                [
                    116,
                    0,
                    0
                ],
                [
                    117,
                    0,
                    0
                ],
                [
                    118,
                    0,
                    0
                ],
                [
                    119,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p78",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p79",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "3",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "61cdf1c6242552b1"
            },
            "inputs": [
                [
                    120,
                    0,
                    0
                ],
                [
                    121,
                    0,
                    0
                ],
                [
                    122,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        2,
        3,
        5,
        6,
        7,
        8,
        13,
        14,
        15,
        17,
        18,
        19,
        20,
        25,
        26,
        27,
        29,
        30,
        31,
        32,
        37,
        38,
        39,
        41,
        42,
        43,
        44,
        49,
        50,
        51,
        53,
        54,
        55,
        56,
        58,
        59,
        60,
        61,
        65,
        66,
        67,
        69,
        70,
        71,
        72,
        74,
        75,
        76,
        77,
        81,
        82,
        83,
        85,
        86,
        87,
        88,
        90,
        91,
        92,
        93,
        97,
        98,
        99,
        101,
        102,
        103,
        104,
        106,
        107,
        108,
        109,
        113,
        114,
        115,
        117,
        118,
        119,
        121,
        122
    ],
    "heads": [
        [
            123,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
