{"nodes": [{"op": "null", "name": "input_25", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "cbf82f11f3177c85"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_21", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "636a5321792fc858"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "out_layout": "", "layout": "NCHW", "hash": "f95473e579929258"}, "inputs": [[1, 0, 0]]}], "arg_nodes": [0], "heads": [[2, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2]], "storage_id": ["list_int", [23, 13, 24]], "shape": ["list_shape", [[1, 32, 256, 256], [1, 32, 256, 256], [1, 32, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3], "extra": {"inputs": [25], "outputs": [27]}}