{"nodes": [{"op": "null", "name": "input_39", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "83891b787983dadd"}, "inputs": []}, {"op": "null", "name": "input_90", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575__1", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "5d3f5c8d22541d45"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "hash": "9ed233230c188a39"}, "inputs": [[1, 0, 0], [2, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_10", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_10", "hash": "124e1fbf92ab5a82"}, "inputs": [[3, 0, 0]]}, {"op": "null", "name": "p56", "inputs": []}, {"op": "null", "name": "p57", "inputs": []}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "14adf59ea30e79e6"}, "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_42", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[9, 0, 0]]}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "44f82481a29f6711"}, "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575__2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575__2", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "4d01d43cbe9069e9"}, "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]}], "arg_nodes": [0, 1, 5, 6, 7, 8, 11, 12, 13, 14, 16, 17, 18, 19], "heads": [[20, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]], "storage_id": ["list_int", [35, 37, 25, 73, 25, 78, 79, 80, 81, 82, 25, 83, 84, 85, 86, 87, 88, 89, 90, 91, 25]], "shape": ["list_shape", [[1, 64, 128, 128], [1, 64, 128, 128], [1, 64, 128, 128], [1, 128, 128, 128], [1, 128, 128, 128], [64, 128, 3, 3], [64], [64, 1, 1], [64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [64, 64, 3, 3], [64], [64, 1, 1], [64, 1, 1], [1, 64, 128, 128], [64, 32, 3, 3], [32], [32, 1, 1], [32, 1, 1], [1, 32, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21], "extra": {"inputs": [39, 90], "outputs": [108]}}