{"nodes": [{"op": "null", "name": "input_25", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "784e59301ea3b6e7"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_21", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "636a5321792fc858"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "out_layout": "", "layout": "NCHW", "hash": "f95473e579929258"}, "inputs": [[1, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_3", "hash": "8d9857381559bffe"}, "inputs": [[2, 0, 0]]}, {"op": "null", "name": "p16", "inputs": []}, {"op": "null", "name": "p17", "inputs": []}, {"op": "null", "name": "p18", "inputs": []}, {"op": "null", "name": "p19", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "ae3ea90ce0dcd82c"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_4", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[8, 0, 0]]}, {"op": "null", "name": "p20", "inputs": []}, {"op": "null", "name": "p21", "inputs": []}, {"op": "null", "name": "p22", "inputs": []}, {"op": "null", "name": "p23", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "83891b787983dadd"}, "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[14, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "out_layout": "", "layout": "NCHW", "hash": "4d28db8d44201a17"}, "inputs": [[15, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_5", "hash": "2671da4b32d0b376"}, "inputs": [[16, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "78c3689fa5a33327"}, "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[22, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "null", "name": "p31", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "4d1da5372af05643"}, "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[28, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "7372b946bc54379f"}, "inputs": [[29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "61936ac1605612d0"}, "inputs": [[30, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8c258dc25c585a3c"}, "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_8", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_8", "hash": "eef8dacc5d543f0d"}, "inputs": [[36, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "ce381f97c1c6b641"}, "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 0]]}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575_", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575_", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "8badd664bf26d97b"}, "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "hash": "de93b1969d09d560"}, "inputs": [[47, 0, 0], [29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_9", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_9", "hash": "67262316d98e1e1f"}, "inputs": [[48, 0, 0]]}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "384b94073f4fd6f3"}, "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_62", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[54, 0, 0]]}, {"op": "null", "name": "p48", "inputs": []}, {"op": "null", "name": "p49", "inputs": []}, {"op": "null", "name": "p50", "inputs": []}, {"op": "null", "name": "p51", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "f4738973ef3fa2bd"}, "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0]]}, {"op": "null", "name": "p52", "inputs": []}, {"op": "null", "name": "p53", "inputs": []}, {"op": "null", "name": "p54", "inputs": []}, {"op": "null", "name": "p55", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575__1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round__11787854290316248575__1", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "5d3f5c8d22541d45"}, "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0]]}], "arg_nodes": [0, 4, 5, 6, 7, 10, 11, 12, 13, 18, 19, 20, 21, 24, 25, 26, 27, 32, 33, 34, 35, 38, 39, 40, 41, 43, 44, 45, 46, 50, 51, 52, 53, 56, 57, 58, 59, 61, 62, 63, 64], "heads": [[14, 0, 0], [65, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]], "storage_id": ["list_int", [23, 13, 24, 25, 26, 27, 28, 29, 30, 25, 31, 32, 33, 34, 35, 25, 36, 37, 38, 39, 40, 41, 42, 37, 43, 44, 45, 46, 47, 37, 48, 49, 50, 51, 52, 53, 54, 49, 55, 56, 57, 58, 59, 60, 61, 62, 63, 49, 59, 37, 64, 65, 66, 67, 68, 37, 69, 70, 71, 72, 73, 74, 75, 76, 77, 37]], "shape": ["list_shape", [[1, 32, 256, 256], [1, 32, 256, 256], [1, 32, 128, 128], [1, 32, 128, 128], [64, 32, 3, 3], [64], [64, 1, 1], [64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [64, 64, 3, 3], [64], [64, 1, 1], [64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [1, 64, 64, 64], [1, 64, 64, 64], [128, 64, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [1, 128, 64, 64], [128, 128, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [1, 128, 64, 64], [1, 128, 32, 32], [1, 128, 32, 32], [256, 128, 3, 3], [256], [256, 1, 1], [256, 1, 1], [1, 256, 32, 32], [1, 256, 32, 32], [256, 256, 3, 3], [256], [256, 1, 1], [256, 1, 1], [1, 256, 32, 32], [256, 128, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [1, 256, 64, 64], [1, 256, 64, 64], [128, 256, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [1, 128, 64, 64], [128, 128, 3, 3], [128], [128, 1, 1], [128, 1, 1], [1, 128, 64, 64], [128, 64, 3, 3], [64], [64, 1, 1], [64, 1, 1], [1, 64, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66], "extra": {"inputs": [25], "outputs": [39, 90]}}