{"nodes": [{"op": "null", "name": "input_25", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "d1cbc5cea5a46bd8"}, "inputs": []}, {"op": "null", "name": "input_39", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "4505bfd8c02dd1ab"}, "inputs": []}, {"op": "null", "name": "input_53", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "e3e90d4e9e7229a0"}, "inputs": []}, {"op": "null", "name": "input_55", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "05d82dde3e837696"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_21", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "fb6f82e2d6857769"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "b453805ab30bcbb7"}, "inputs": [[1, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "c129c06a6c572c9e"}, "inputs": [[2, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "6fc4ba3c4bec19c9"}, "inputs": [[3, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "1f954ec01d818b69"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_8", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_8", "hash": "f3dbb5f88bf2f717"}, "inputs": [[12, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "a03d52ea08fb1fca"}, "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "5be089a73235426c"}, "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "hash": "94a89f015bdfecd8"}, "inputs": [[23, 0, 0], [6, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_9", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_9", "hash": "0615b8b7451279fa"}, "inputs": [[24, 0, 0]]}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "db33a66f0dd4fc31"}, "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_62", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "c129c06a6c572c9e"}, "inputs": [[30, 0, 0]]}, {"op": "null", "name": "p48", "inputs": []}, {"op": "null", "name": "p49", "inputs": []}, {"op": "null", "name": "p50", "inputs": []}, {"op": "null", "name": "p51", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "fb7b7c4088293773"}, "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0]]}, {"op": "null", "name": "p52", "inputs": []}, {"op": "null", "name": "p53", "inputs": []}, {"op": "null", "name": "p54", "inputs": []}, {"op": "null", "name": "p55", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__1", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "d535ba8827fa3f41"}, "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "hash": "93ffe587eaab2f81"}, "inputs": [[41, 0, 0], [5, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_10", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_10", "hash": "61936ac1605612d0"}, "inputs": [[42, 0, 0]]}, {"op": "null", "name": "p56", "inputs": []}, {"op": "null", "name": "p57", "inputs": []}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8753268c76f282f4"}, "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_42", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "b453805ab30bcbb7"}, "inputs": [[48, 0, 0]]}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0b5132345bbf9775"}, "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "ccb7ba0eb745316d"}, "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_2", "hash": "cf11f1e3b5b8d2f0"}, "inputs": [[59, 0, 0], [4, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_11", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_11", "hash": "2671da4b32d0b376"}, "inputs": [[60, 0, 0]]}, {"op": "null", "name": "p68", "inputs": []}, {"op": "null", "name": "p69", "inputs": []}, {"op": "null", "name": "p70", "inputs": []}, {"op": "null", "name": "p71", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_7", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_7", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "08a195338df18e55"}, "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_22", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "fb6f82e2d6857769"}, "inputs": [[66, 0, 0]]}, {"op": "null", "name": "p72", "inputs": []}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "null", "name": "p75", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0e505f02fbbc64e4"}, "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 0]]}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__3", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "c26f1a4d896065f2"}, "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 8, 9, 10, 11, 14, 15, 16, 17, 19, 20, 21, 22, 26, 27, 28, 29, 32, 33, 34, 35, 37, 38, 39, 40, 44, 45, 46, 47, 50, 51, 52, 53, 55, 56, 57, 58, 62, 63, 64, 65, 68, 69, 70, 71, 73, 74, 75, 76], "heads": [[77, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [23, 35, 47, 48, 13, 25, 37, 49, 50, 51, 52, 53, 54, 49, 55, 56, 57, 58, 59, 60, 61, 62, 63, 49, 59, 37, 64, 65, 66, 67, 68, 37, 69, 70, 71, 72, 73, 74, 75, 76, 77, 37, 73, 25, 78, 79, 80, 81, 82, 25, 83, 84, 85, 86, 87, 88, 89, 90, 91, 25, 87, 13, 92, 93, 94, 95, 96, 13, 97, 98, 99, 100, 101, 102, 103, 104, 105, 13]], "shape": ["list_shape", [[1, 32, 64, 64], [1, 64, 32, 32], [1, 128, 16, 16], [1, 128, 8, 8], [1, 32, 64, 64], [1, 64, 32, 32], [1, 128, 16, 16], [1, 128, 8, 8], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 8, 8], [1, 256, 8, 8], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 8, 8], [256, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [1, 256, 16, 16], [1, 256, 16, 16], [128, 256, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [1, 128, 16, 16], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [1, 128, 32, 32], [1, 128, 32, 32], [64, 128, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [1, 64, 32, 32], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [64, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [1, 64, 64, 64], [1, 64, 64, 64], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [1, 32, 64, 64], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [32, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78], "extra": {"inputs": [25, 39, 53, 55], "outputs": [126]}}