{"nodes": [{"op": "null", "name": "input_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "ce1727ed0a5d802d"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "85165d63e18469f5"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p4", "inputs": []}, {"op": "null", "name": "p5", "inputs": []}, {"op": "null", "name": "p6", "inputs": []}, {"op": "null", "name": "p7", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "c35c41a655f8a1a2"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "85165d63e18469f5"}, "inputs": [[6, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "out_layout": "", "layout": "NCHW", "hash": "9113d81e30deba46"}, "inputs": [[7, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_1", "hash": "db38370063b8e991"}, "inputs": [[8, 0, 0]]}, {"op": "null", "name": "p8", "inputs": []}, {"op": "null", "name": "p9", "inputs": []}, {"op": "null", "name": "p10", "inputs": []}, {"op": "null", "name": "p11", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "7001edc39d8274ff"}, "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "636a5321792fc858"}, "inputs": [[14, 0, 0]]}, {"op": "null", "name": "p12", "inputs": []}, {"op": "null", "name": "p13", "inputs": []}, {"op": "null", "name": "p14", "inputs": []}, {"op": "null", "name": "p15", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "cbf82f11f3177c85"}, "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_21", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "636a5321792fc858"}, "inputs": [[20, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "out_layout": "", "layout": "NCHW", "hash": "f95473e579929258"}, "inputs": [[21, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_3", "hash": "8d9857381559bffe"}, "inputs": [[22, 0, 0]]}, {"op": "null", "name": "p16", "inputs": []}, {"op": "null", "name": "p17", "inputs": []}, {"op": "null", "name": "p18", "inputs": []}, {"op": "null", "name": "p19", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "4269718d6b39ec58"}, "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_4", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[28, 0, 0]]}, {"op": "null", "name": "p20", "inputs": []}, {"op": "null", "name": "p21", "inputs": []}, {"op": "null", "name": "p22", "inputs": []}, {"op": "null", "name": "p23", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0fc1d36e3a42d9cc"}, "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[34, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "out_layout": "", "layout": "NCHW", "hash": "4d28db8d44201a17"}, "inputs": [[35, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_5", "hash": "2671da4b32d0b376"}, "inputs": [[36, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "67a4838af2787f3f"}, "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[42, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "null", "name": "p31", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0cf191d346f9c157"}, "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5, 10, 11, 12, 13, 16, 17, 18, 19, 24, 25, 26, 27, 30, 31, 32, 33, 38, 39, 40, 41, 44, 45, 46, 47], "heads": [[6, 0, 0], [20, 0, 0], [34, 0, 0], [48, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [5, 6, 7, 8, 9, 10, 11, 6, 12, 13, 14, 15, 16, 17, 18, 13, 19, 20, 21, 22, 23, 13, 24, 25, 26, 27, 28, 29, 30, 25, 31, 32, 33, 34, 35, 25, 36, 37, 38, 39, 40, 41, 42, 37, 43, 44, 45, 46, 47]], "shape": ["list_shape", [[1, 16, 512, 512], [1, 16, 512, 512], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 512, 512], [1, 16, 512, 512], [1, 16, 256, 256], [1, 16, 256, 256], [32, 16, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 256, 256], [1, 32, 256, 256], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 256, 256], [1, 32, 256, 256], [1, 32, 128, 128], [1, 32, 128, 128], [64, 32, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [1, 64, 64, 64], [1, 64, 64, 64], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 64, 64], [1, 128, 64, 64], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], "extra": {"inputs": [5], "outputs": [11, 25, 39, 53]}}