{"nodes": [{"op": "null", "name": "input_39", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "83891b787983dadd"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "out_layout": "", "layout": "NCHW", "hash": "4d28db8d44201a17"}, "inputs": [[1, 0, 0]]}], "arg_nodes": [0], "heads": [[2, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8"]], "device_index": ["list_int", [1, 1, 1]], "storage_id": ["list_int", [35, 25, 36]], "shape": ["list_shape", [[1, 64, 128, 128], [1, 64, 128, 128], [1, 64, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3], "extra": {"inputs": [39], "outputs": [41]}}