{"nodes": [{"op": "null", "name": "p89", "inputs": []}], "arg_nodes": [0], "heads": [[0, 0, 0]], "attrs": {"dltype": ["list_str", ["float32"]], "device_index": ["list_int", [1]], "storage_id": ["list_int", [117]], "shape": ["list_shape", [[1]]]}, "node_row_ptr": [0, 1], "extra": {"inputs": [], "outputs": [141]}}