{"nodes": [{"op": "null", "name": "input_53", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "4d1da5372af05643"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "6bd59b3449230bf3"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "7372b946bc54379f"}, "inputs": [[1, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "61936ac1605612d0"}, "inputs": [[2, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8c258dc25c585a3c"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]}], "arg_nodes": [0, 4, 5, 6, 7], "heads": [[8, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [1, 1, 1, 1, 1, 1, 1, 1, 1]], "storage_id": ["list_int", [47, 37, 48, 49, 50, 51, 52, 53, 54]], "shape": ["list_shape", [[1, 128, 64, 64], [1, 128, 64, 64], [1, 128, 32, 32], [1, 128, 32, 32], [256, 128, 3, 3], [256], [256, 1, 1], [256, 1, 1], [1, 256, 32, 32]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9], "extra": {"inputs": [53], "outputs": [61]}}