{
    "nodes": [
        {
            "op": "null",
            "name": "input_0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p1",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p2",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "45db582c9c1f8953"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ],
                [
                    1,
                    0,
                    0
                ],
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p3",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p4",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p5",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p6",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "dac424a5efaeb7f7"
            },
            "inputs": [
                [
                    4,
                    0,
                    0
                ],
                [
                    5,
                    0,
                    0
                ],
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ],
                [
                    8,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide",
                "hash": "56af2c0c86bd559b"
            },
            "inputs": [
                [
                    9,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "5b3643843e168cf3"
            },
            "inputs": [
                [
                    10,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p8",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p9",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "eafc8eab6d4cdfe4"
            },
            "inputs": [
                [
                    11,
                    0,
                    0
                ],
                [
                    12,
                    0,
                    0
                ],
                [
                    13,
                    0,
                    0
                ],
                [
                    14,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p10",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p11",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p12",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p13",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "d1cbc5cea5a46bd8"
            },
            "inputs": [
                [
                    15,
                    0,
                    0
                ],
                [
                    16,
                    0,
                    0
                ],
                [
                    17,
                    0,
                    0
                ],
                [
                    18,
                    0,
                    0
                ],
                [
                    19,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        2,
        3,
        5,
        6,
        7,
        8,
        12,
        13,
        14,
        16,
        17,
        18,
        19
    ],
    "heads": [
        [
            9,
            0,
            0
        ],
        [
            20,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                3,
                4,
                5,
                6,
                7,
                8,
                9,
                4,
                10,
                11,
                12,
                13,
                14,
                15,
                16,
                17,
                18,
                10
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    3,
                    128,
                    128
                ],
                [
                    16,
                    3,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    128,
                    128
                ],
                [
                    16,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    128,
                    128
                ],
                [
                    1,
                    16,
                    128,
                    128
                ],
                [
                    1,
                    16,
                    64,
                    64
                ],
                [
                    32,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    64,
                    64
                ],
                [
                    32,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    64,
                    64
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21
    ],
    "extra": {
        "inputs": [
            0
        ],
        "outputs": [
            9,
            20
        ]
    }
}