{"nodes": [{"op": "null", "name": "input_11", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "c35c41a655f8a1a2"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "85165d63e18469f5"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "out_layout": "", "layout": "NCHW", "hash": "9113d81e30deba46"}, "inputs": [[1, 0, 0]]}], "arg_nodes": [0], "heads": [[2, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2]], "storage_id": ["list_int", [11, 6, 12]], "shape": ["list_shape", [[1, 16, 512, 512], [1, 16, 512, 512], [1, 16, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3], "extra": {"inputs": [11], "outputs": [13]}}