{"nodes": [{"op": "null", "name": "input_11", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "c35c41a655f8a1a2"}, "inputs": []}, {"op": "null", "name": "input_126", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__3", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "f84a06c73561c81f"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "85165d63e18469f5"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_3", "hash": "b7fdca7755cd2709"}, "inputs": [[1, 0, 0], [2, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_12", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_12", "hash": "186333aa7e215879"}, "inputs": [[3, 0, 0]]}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "e8e2cea71486c2b1"}, "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "85165d63e18469f5"}, "inputs": [[9, 0, 0]]}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "null", "name": "p86", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "b83cfcda2b3569ee"}, "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]}, {"op": "null", "name": "p87", "inputs": []}, {"op": "null", "name": "p88", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "61cdf1c6242552b1"}, "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]}], "arg_nodes": [0, 1, 5, 6, 7, 8, 11, 12, 13, 15, 16], "heads": [[17, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [11, 13, 6, 101, 6, 106, 107, 108, 109, 110, 6, 111, 112, 113, 114, 115, 116, 117]], "shape": ["list_shape", [[1, 16, 512, 512], [1, 16, 512, 512], [1, 16, 512, 512], [1, 32, 512, 512], [1, 32, 512, 512], [16, 32, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 512, 512], [1, 16, 512, 512], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 512, 512], [1, 16, 3, 3], [1, 1, 1], [1, 1, 512, 512]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18], "extra": {"inputs": [11, 126], "outputs": [141]}}