{"nodes": [{"op": "null", "name": "input_73", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "hash": "de93b1969d09d560"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_9", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_9", "hash": "67262316d98e1e1f"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "b83a6055f3015826"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5], "heads": [[6, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [59, 37, 64, 65, 66, 67, 68]], "shape": ["list_shape", [[1, 256, 64, 64], [1, 256, 64, 64], [128, 256, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7], "extra": {"inputs": [73], "outputs": [79]}}