{"nodes": [{"op": "null", "name": "input_9", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "c35c41a655f8a1a2"}, "inputs": []}, {"op": "null", "name": "input_91", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_2", "hash": "9e940466005aa1f3"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "85165d63e18469f5"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "fa27adaace0bfe80"}, "inputs": [[1, 0, 0]]}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_7", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "f81b264d19b9a6be"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "afcc3e3243b199b7"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "null", "name": "p68", "inputs": []}, {"op": "null", "name": "p69", "inputs": []}, {"op": "null", "name": "p70", "inputs": []}, {"op": "null", "name": "p71", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "e2fccacfae4878e3"}, "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_concatenate_multiply_round_clip_cast_3", "hash": "9c8a637413505916"}, "inputs": [[17, 0, 0], [2, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "186333aa7e215879"}, "inputs": [[18, 0, 0]]}, {"op": "null", "name": "p72", "inputs": []}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_8", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0258e262c093a80d"}, "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]]}, {"op": "null", "name": "p75", "inputs": []}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "b83cfcda2b3569ee"}, "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "61cdf1c6242552b1"}, "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]}], "arg_nodes": [0, 1, 4, 5, 6, 8, 9, 10, 11, 13, 14, 15, 16, 20, 21, 22, 24, 25, 26, 28, 29], "heads": [[30, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [9, 41, 4, 14, 72, 73, 74, 23, 75, 76, 77, 78, 14, 79, 80, 81, 82, 23, 14, 4, 83, 84, 85, 23, 86, 87, 88, 14, 89, 90, 37]], "shape": ["list_shape", [[1, 16, 512, 512], [1, 64, 256, 256], [1, 16, 512, 512], [1, 64, 256, 256], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 256, 256], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 256, 256], [32, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 512, 512], [1, 32, 512, 512], [1, 32, 512, 512], [16, 32, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 512, 512], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 512, 512], [1, 16, 3, 3], [1, 1, 1], [1, 1, 512, 512]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31], "extra": {"inputs": [9, 91], "outputs": [119]}}