{"nodes": [{"op": "null", "name": "input_55", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "05d82dde3e837696"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "6fc4ba3c4bec19c9"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "1f954ec01d818b69"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_8", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_8", "hash": "f3dbb5f88bf2f717"}, "inputs": [[6, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "a03d52ea08fb1fca"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "5be089a73235426c"}, "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5, 8, 9, 10, 11, 13, 14, 15, 16], "heads": [[17, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [48, 49, 50, 51, 52, 53, 54, 49, 55, 56, 57, 58, 59, 60, 61, 62, 63, 49]], "shape": ["list_shape", [[1, 128, 8, 8], [1, 128, 8, 8], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 8, 8], [1, 256, 8, 8], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 8, 8], [256, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18], "extra": {"inputs": [55], "outputs": [72]}}