{"nodes": [{"op": "null", "name": "input_91", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "hash": "9ed233230c188a39"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_10", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_10", "hash": "124e1fbf92ab5a82"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p56", "inputs": []}, {"op": "null", "name": "p57", "inputs": []}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "83b41d6807472e19"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_42", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "264e358d1dbf32bc"}, "inputs": [[6, 0, 0]]}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8cb240c20c9a61e5"}, "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "bb98934acee9f434"}, "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5, 8, 9, 10, 11, 13, 14, 15, 16], "heads": [[17, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [73, 25, 78, 79, 80, 81, 82, 25, 83, 84, 85, 86, 87, 88, 89, 90, 91, 25]], "shape": ["list_shape", [[1, 128, 128, 128], [1, 128, 128, 128], [64, 128, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [1, 64, 128, 128], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 128, 128], [64, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18], "extra": {"inputs": [91], "outputs": [108]}}