{"nodes": [{"op": "null", "name": "input_127", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_3", "hash": "9f1d52c5685dd2f1"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_12", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_12", "hash": "8d9857381559bffe"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0c4eb5b24091af25"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 5], "heads": [[6, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [101, 6, 106, 107, 108, 109, 110]], "shape": ["list_shape", [[1, 32, 128, 128], [1, 32, 128, 128], [16, 32, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7], "extra": {"inputs": [127], "outputs": [133]}}