{
    "nodes": [
        {
            "op": "null",
            "name": "input_20",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "d1cbc5cea5a46bd8"
            },
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_1",
                "hash": "fb6f82e2d6857769"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_1",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "952b6d5769427126"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p14",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p15",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p16",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "b99720a7caeefa56"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ],
                [
                    4,
                    0,
                    0
                ],
                [
                    5,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p17",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p18",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p19",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p20",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "4505bfd8c02dd1ab"
            },
            "inputs": [
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ],
                [
                    8,
                    0,
                    0
                ],
                [
                    9,
                    0,
                    0
                ],
                [
                    10,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        3,
        4,
        5,
        7,
        8,
        9,
        10
    ],
    "heads": [
        [
            11,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                10,
                14,
                19,
                20,
                21,
                22,
                23,
                24,
                25,
                26,
                27,
                19
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    32,
                    64,
                    64
                ],
                [
                    1,
                    32,
                    64,
                    64
                ],
                [
                    1,
                    32,
                    32,
                    32
                ],
                [
                    64,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    32,
                    32
                ],
                [
                    64,
                    64,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    32,
                    32
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12
    ],
    "extra": {
        "inputs": [
            20
        ],
        "outputs": [
            31
        ]
    }
}