{"nodes": [{"op": "null", "name": "input_11", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "dac424a5efaeb7f7"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "56af2c0c86bd559b"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "out_layout": "", "layout": "NCHW", "hash": "3771d393aec7f252"}, "inputs": [[1, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_1", "hash": "608d7ece6fd8d965"}, "inputs": [[2, 0, 0]]}, {"op": "null", "name": "p8", "inputs": []}, {"op": "null", "name": "p9", "inputs": []}, {"op": "null", "name": "p10", "inputs": []}, {"op": "null", "name": "p11", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "9b2cce6897ab27b0"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "fb6f82e2d6857769"}, "inputs": [[8, 0, 0]]}, {"op": "null", "name": "p12", "inputs": []}, {"op": "null", "name": "p13", "inputs": []}, {"op": "null", "name": "p14", "inputs": []}, {"op": "null", "name": "p15", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "d1cbc5cea5a46bd8"}, "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_21", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "fb6f82e2d6857769"}, "inputs": [[14, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_1", "out_layout": "", "layout": "NCHW", "hash": "9ff1c88704eedebc"}, "inputs": [[15, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_3", "hash": "243cc904f9bf02df"}, "inputs": [[16, 0, 0]]}, {"op": "null", "name": "p16", "inputs": []}, {"op": "null", "name": "p17", "inputs": []}, {"op": "null", "name": "p18", "inputs": []}, {"op": "null", "name": "p19", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "f544bead7ce209ad"}, "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_4", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "b453805ab30bcbb7"}, "inputs": [[22, 0, 0]]}, {"op": "null", "name": "p20", "inputs": []}, {"op": "null", "name": "p21", "inputs": []}, {"op": "null", "name": "p22", "inputs": []}, {"op": "null", "name": "p23", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "4505bfd8c02dd1ab"}, "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_41", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "b453805ab30bcbb7"}, "inputs": [[28, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_2", "out_layout": "", "layout": "NCHW", "hash": "f2a97c133febc5f5"}, "inputs": [[29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_5", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_5", "hash": "e192afb77f1651b1"}, "inputs": [[30, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "256f63349132ffbd"}, "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_6", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "c129c06a6c572c9e"}, "inputs": [[36, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "null", "name": "p30", "inputs": []}, {"op": "null", "name": "p31", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "e3e90d4e9e7229a0"}, "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "c129c06a6c572c9e"}, "inputs": [[42, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "05d82dde3e837696"}, "inputs": [[43, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_7", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_7", "hash": "6fc4ba3c4bec19c9"}, "inputs": [[44, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "1f954ec01d818b69"}, "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_8", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_8", "hash": "f3dbb5f88bf2f717"}, "inputs": [[50, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "a03d52ea08fb1fca"}, "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 0]]}, {"op": "null", "name": "p40", "inputs": []}, {"op": "null", "name": "p41", "inputs": []}, {"op": "null", "name": "p42", "inputs": []}, {"op": "null", "name": "p43", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942_", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "5be089a73235426c"}, "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast", "hash": "94a89f015bdfecd8"}, "inputs": [[61, 0, 0], [43, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_9", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_9", "hash": "0615b8b7451279fa"}, "inputs": [[62, 0, 0]]}, {"op": "null", "name": "p44", "inputs": []}, {"op": "null", "name": "p45", "inputs": []}, {"op": "null", "name": "p46", "inputs": []}, {"op": "null", "name": "p47", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_5", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "db33a66f0dd4fc31"}, "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_62", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "c129c06a6c572c9e"}, "inputs": [[68, 0, 0]]}, {"op": "null", "name": "p48", "inputs": []}, {"op": "null", "name": "p49", "inputs": []}, {"op": "null", "name": "p50", "inputs": []}, {"op": "null", "name": "p51", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "fb7b7c4088293773"}, "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0]]}, {"op": "null", "name": "p52", "inputs": []}, {"op": "null", "name": "p53", "inputs": []}, {"op": "null", "name": "p54", "inputs": []}, {"op": "null", "name": "p55", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__1", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__1", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "d535ba8827fa3f41"}, "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_1", "hash": "93ffe587eaab2f81"}, "inputs": [[79, 0, 0], [29, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_10", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_10", "hash": "61936ac1605612d0"}, "inputs": [[80, 0, 0]]}, {"op": "null", "name": "p56", "inputs": []}, {"op": "null", "name": "p57", "inputs": []}, {"op": "null", "name": "p58", "inputs": []}, {"op": "null", "name": "p59", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8753268c76f282f4"}, "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_42", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "b453805ab30bcbb7"}, "inputs": [[86, 0, 0]]}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0b5132345bbf9775"}, "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "ccb7ba0eb745316d"}, "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 0]]}], "arg_nodes": [0, 4, 5, 6, 7, 10, 11, 12, 13, 18, 19, 20, 21, 24, 25, 26, 27, 32, 33, 34, 35, 38, 39, 40, 41, 46, 47, 48, 49, 52, 53, 54, 55, 57, 58, 59, 60, 64, 65, 66, 67, 70, 71, 72, 73, 75, 76, 77, 78, 82, 83, 84, 85, 88, 89, 90, 91, 93, 94, 95, 96], "heads": [[14, 0, 0], [97, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [11, 6, 12, 13, 14, 15, 16, 17, 18, 13, 19, 20, 21, 22, 23, 13, 24, 25, 26, 27, 28, 29, 30, 25, 31, 32, 33, 34, 35, 25, 36, 37, 38, 39, 40, 41, 42, 37, 43, 44, 45, 46, 47, 37, 48, 49, 50, 51, 52, 53, 54, 49, 55, 56, 57, 58, 59, 60, 61, 62, 63, 49, 59, 37, 64, 65, 66, 67, 68, 37, 69, 70, 71, 72, 73, 74, 75, 76, 77, 37, 73, 25, 78, 79, 80, 81, 82, 25, 83, 84, 85, 86, 87, 88, 89, 90, 91, 25]], "shape": ["list_shape", [[1, 16, 128, 128], [1, 16, 128, 128], [1, 16, 64, 64], [1, 16, 64, 64], [32, 16, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [1, 32, 64, 64], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [1, 32, 64, 64], [1, 32, 32, 32], [1, 32, 32, 32], [64, 32, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [1, 64, 32, 32], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [1, 64, 32, 32], [1, 64, 16, 16], [1, 64, 16, 16], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [1, 128, 16, 16], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [1, 128, 16, 16], [1, 128, 8, 8], [1, 128, 8, 8], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 8, 8], [1, 256, 8, 8], [256, 256, 3, 3], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 1, 1], [1, 256, 8, 8], [256, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [1, 256, 16, 16], [1, 256, 16, 16], [128, 256, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [1, 128, 16, 16], [128, 128, 3, 3], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 1, 1], [1, 128, 16, 16], [128, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [1, 128, 32, 32], [1, 128, 32, 32], [64, 128, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [1, 64, 32, 32], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [64, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98], "extra": {"inputs": [11], "outputs": [25, 108]}}