{"nodes": [{"op": "null", "name": "input_53", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "e3e90d4e9e7229a0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_61", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_6", "hash": "c129c06a6c572c9e"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast_3", "out_layout": "", "layout": "NCHW", "hash": "05d82dde3e837696"}, "inputs": [[1, 0, 0]]}], "arg_nodes": [0], "heads": [[2, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2]], "storage_id": ["list_int", [47, 37, 48]], "shape": ["list_shape", [[1, 128, 16, 16], [1, 128, 16, 16], [1, 128, 8, 8]]]}, "node_row_ptr": [0, 1, 2, 3], "extra": {"inputs": [53], "outputs": [55]}}