{"nodes": [{"op": "null", "name": "input_11", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "dac424a5efaeb7f7"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "56af2c0c86bd559b"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_max_pool2d_multiply_round_clip_cast", "out_layout": "", "layout": "NCHW", "hash": "3771d393aec7f252"}, "inputs": [[1, 0, 0]]}], "arg_nodes": [0], "heads": [[2, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "int8"]], "device_index": ["list_int", [2, 2, 2]], "storage_id": ["list_int", [11, 6, 12]], "shape": ["list_shape", [[1, 16, 128, 128], [1, 16, 128, 128], [1, 16, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3], "extra": {"inputs": [11], "outputs": [13]}}