{"nodes": [{"op": "null", "name": "input_11", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "dac424a5efaeb7f7"}, "inputs": []}, {"op": "null", "name": "input_25", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "d1cbc5cea5a46bd8"}, "inputs": []}, {"op": "null", "name": "input_97", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8753268c76f282f4"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "56af2c0c86bd559b"}, "inputs": [[0, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_21", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "fb6f82e2d6857769"}, "inputs": [[1, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_42", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_4", "hash": "b453805ab30bcbb7"}, "inputs": [[2, 0, 0]]}, {"op": "null", "name": "p60", "inputs": []}, {"op": "null", "name": "p61", "inputs": []}, {"op": "null", "name": "p62", "inputs": []}, {"op": "null", "name": "p63", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0b5132345bbf9775"}, "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0]]}, {"op": "null", "name": "p64", "inputs": []}, {"op": "null", "name": "p65", "inputs": []}, {"op": "null", "name": "p66", "inputs": []}, {"op": "null", "name": "p67", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__2", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "ccb7ba0eb745316d"}, "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_2", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_2", "hash": "cf11f1e3b5b8d2f0"}, "inputs": [[15, 0, 0], [4, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_11", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_11", "hash": "2671da4b32d0b376"}, "inputs": [[16, 0, 0]]}, {"op": "null", "name": "p68", "inputs": []}, {"op": "null", "name": "p69", "inputs": []}, {"op": "null", "name": "p70", "inputs": []}, {"op": "null", "name": "p71", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_7", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_7", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "08a195338df18e55"}, "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_22", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_2", "hash": "fb6f82e2d6857769"}, "inputs": [[22, 0, 0]]}, {"op": "null", "name": "p72", "inputs": []}, {"op": "null", "name": "p73", "inputs": []}, {"op": "null", "name": "p74", "inputs": []}, {"op": "null", "name": "p75", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0e505f02fbbc64e4"}, "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]}, {"op": "null", "name": "p76", "inputs": []}, {"op": "null", "name": "p77", "inputs": []}, {"op": "null", "name": "p78", "inputs": []}, {"op": "null", "name": "p79", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__3", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_multiply_round_clip_cas_14150951870605584942__3", "out_layout": "", "kernel_layout": "IOHW", "data_layout": "NCHW", "hash": "c26f1a4d896065f2"}, "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_3", "attrs": {"num_outputs": "1", "num_inputs": "2", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_concatenate_multiply_round_clip_cast_3", "hash": "9f1d52c5685dd2f1"}, "inputs": [[33, 0, 0], [3, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide_12", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide_12", "hash": "8d9857381559bffe"}, "inputs": [[34, 0, 0]]}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_8", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "0c4eb5b24091af25"}, "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide2", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "func_name": "tvmgen_default_fused_cast_divide", "hash": "56af2c0c86bd559b"}, "inputs": [[40, 0, 0]]}, {"op": "null", "name": "p84", "inputs": []}, {"op": "null", "name": "p85", "inputs": []}, {"op": "null", "name": "p86", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "697d7aa276bf8a9d"}, "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0]]}, {"op": "null", "name": "p87", "inputs": []}, {"op": "null", "name": "p88", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "c3233e0e4820aef0"}, "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]}], "arg_nodes": [0, 1, 2, 6, 7, 8, 9, 11, 12, 13, 14, 18, 19, 20, 21, 24, 25, 26, 27, 29, 30, 31, 32, 36, 37, 38, 39, 42, 43, 44, 46, 47], "heads": [[48, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "int8", "int8", "float32", "float32", "float32", "float32", "float32", "int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [11, 23, 82, 6, 13, 25, 83, 84, 85, 86, 87, 88, 89, 90, 91, 25, 87, 13, 92, 93, 94, 95, 96, 13, 97, 98, 99, 100, 101, 102, 103, 104, 105, 13, 101, 6, 106, 107, 108, 109, 110, 6, 111, 112, 113, 114, 115, 116, 117]], "shape": ["list_shape", [[1, 16, 128, 128], [1, 32, 64, 64], [1, 64, 32, 32], [1, 16, 128, 128], [1, 32, 64, 64], [1, 64, 32, 32], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 32, 32], [64, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [1, 64, 64, 64], [1, 64, 64, 64], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [1, 32, 64, 64], [32, 32, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 64, 64], [32, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 128, 128], [1, 32, 128, 128], [1, 32, 128, 128], [16, 32, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 128, 128], [1, 16, 128, 128], [16, 16, 3, 3], [1, 16, 1, 1], [1, 16, 1, 1], [1, 16, 128, 128], [1, 16, 3, 3], [1, 1, 1], [1, 1, 128, 128]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], "extra": {"inputs": [11, 25, 97], "outputs": [141]}}