{
    "nodes": [
        {
            "op": "null",
            "name": "input_9",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "dac424a5efaeb7f7"
            },
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide",
                "hash": "56af2c0c86bd559b"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "5b3643843e168cf3"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p8",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p9",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "eafc8eab6d4cdfe4"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ],
                [
                    4,
                    0,
                    0
                ],
                [
                    5,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p10",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p11",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p12",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p13",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "d1cbc5cea5a46bd8"
            },
            "inputs": [
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ],
                [
                    8,
                    0,
                    0
                ],
                [
                    9,
                    0,
                    0
                ],
                [
                    10,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_1",
                "hash": "fb6f82e2d6857769"
            },
            "inputs": [
                [
                    11,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_1",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "952b6d5769427126"
            },
            "inputs": [
                [
                    12,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p14",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p15",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p16",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "b99720a7caeefa56"
            },
            "inputs": [
                [
                    13,
                    0,
                    0
                ],
                [
                    14,
                    0,
                    0
                ],
                [
                    15,
                    0,
                    0
                ],
                [
                    16,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p17",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p18",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p19",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p20",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "4505bfd8c02dd1ab"
            },
            "inputs": [
                [
                    17,
                    0,
                    0
                ],
                [
                    18,
                    0,
                    0
                ],
                [
                    19,
                    0,
                    0
                ],
                [
                    20,
                    0,
                    0
                ],
                [
                    21,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        3,
        4,
        5,
        7,
        8,
        9,
        10,
        14,
        15,
        16,
        18,
        19,
        20,
        21
    ],
    "heads": [
        [
            11,
            0,
            0
        ],
        [
            22,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                9,
                4,
                10,
                11,
                12,
                13,
                14,
                15,
                16,
                17,
                18,
                10,
                14,
                19,
                20,
                21,
                22,
                23,
                24,
                25,
                26,
                27,
                19
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    16,
                    128,
                    128
                ],
                [
                    1,
                    16,
                    128,
                    128
                ],
                [
                    1,
                    16,
                    64,
                    64
                ],
                [
                    32,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    64,
                    64
                ],
                [
                    32,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    64,
                    64
                ],
                [
                    1,
                    32,
                    64,
                    64
                ],
                [
                    1,
                    32,
                    32,
                    32
                ],
                [
                    64,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    32,
                    32
                ],
                [
                    64,
                    64,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    32,
                    32
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23
    ],
    "extra": {
        "inputs": [
            9
        ],
        "outputs": [
            20,
            31
        ]
    }
}