{
    "nodes": [
        {
            "op": "null",
            "name": "input_0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p1",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p2",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "3dbb7c2534747700"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ],
                [
                    1,
                    0,
                    0
                ],
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p3",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p4",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p5",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p6",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "c35c41a655f8a1a2"
            },
            "inputs": [
                [
                    4,
                    0,
                    0
                ],
                [
                    5,
                    0,
                    0
                ],
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ],
                [
                    8,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide",
                "hash": "85165d63e18469f5"
            },
            "inputs": [
                [
                    9,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "c1a2714972f6995c"
            },
            "inputs": [
                [
                    10,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p8",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p9",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "402a583eab6e9d86"
            },
            "inputs": [
                [
                    11,
                    0,
                    0
                ],
                [
                    12,
                    0,
                    0
                ],
                [
                    13,
                    0,
                    0
                ],
                [
                    14,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p10",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p11",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p12",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p13",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_1",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "cbf82f11f3177c85"
            },
            "inputs": [
                [
                    15,
                    0,
                    0
                ],
                [
                    16,
                    0,
                    0
                ],
                [
                    17,
                    0,
                    0
                ],
                [
                    18,
                    0,
                    0
                ],
                [
                    19,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_cast_divide_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_cast_divide_1",
                "hash": "636a5321792fc858"
            },
            "inputs": [
                [
                    20,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_max_pool2d_1",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "1",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_max_pool2d_1",
                "out_layout": "",
                "layout": "NCHW",
                "hash": "4ed73dc5cd3319f1"
            },
            "inputs": [
                [
                    21,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p14",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p15",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p16",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "4",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_add_nn_leaky_relu_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "4a7612bf260c4695"
            },
            "inputs": [
                [
                    22,
                    0,
                    0
                ],
                [
                    23,
                    0,
                    0
                ],
                [
                    24,
                    0,
                    0
                ],
                [
                    25,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p17",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p18",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p19",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p20",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_multiply_round_clip_cast_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "0fc1d36e3a42d9cc"
            },
            "inputs": [
                [
                    26,
                    0,
                    0
                ],
                [
                    27,
                    0,
                    0
                ],
                [
                    28,
                    0,
                    0
                ],
                [
                    29,
                    0,
                    0
                ],
                [
                    30,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        2,
        3,
        5,
        6,
        7,
        8,
        12,
        13,
        14,
        16,
        17,
        18,
        19,
        23,
        24,
        25,
        27,
        28,
        29,
        30
    ],
    "heads": [
        [       
            9,
            0,
            0
        ],
        [
            20,
            0,
            0
        ],
        [
            31,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "int8"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                3,
                4,
                5,
                6,
                7,
                8,
                9,
                4,
                10,
                11,
                12,
                13,
                14,
                15,
                16,
                17,
                18,
                10,
                14,
                19,
                20,
                21,
                22,
                23,
                24,
                25,
                26,
                27,
                19
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    3,
                    512,
                    512
                ],
                [
                    16,
                    3,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    16,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    256,
                    256
                ],
                [
                    32,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    32,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    1,
                    32,
                    128,
                    128
                ],
                [
                    64,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    128,
                    128
                ],
                [
                    64,
                    64,
                    3,
                    3
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    1,
                    1
                ],
                [
                    1,
                    64,
                    128,
                    128
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32
    ],
    "extra": {
        "inputs": [
            0
        ],
        "outputs": [
            9,
            20,
            31
        ]
    }
}