{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW3c", 
        "hash": "89a01d6d61c23f4f", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW3c", 
        "kernel_layout": "OIHW3i4o", 
        "hash": "2d0e6608fe41a464", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "899f8dec54577732", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "ea3f763a95a14fa8", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "layout": "NCHW4c", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "d0f10a33e359a872", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_1", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "234c7bbcfe12b552", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_1", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "12962da6b6d56868", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_1", 
        "layout": "NCHW4c", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "8777d684c97e7ca0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_2", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "d8e094a2b2a6b0a4", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_2", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_2", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "d66866b270ed92d9", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_2", 
        "layout": "NCHW4c", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "0cbb16122acb8475", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_3", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "9b8e49cfa8cc8155", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_3", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_3", 
      "attrs": {
        "num_outputs": "1", 
        "out_layout": "", 
        "hash": "357728b399dd6d1d", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_3", 
        "layout": "NCHW4c", 
        "flatten_data": "0", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "beee0f7093859645", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_4", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "589c72ced3aceded", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_4", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "03840f9819e3375d", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "2b546a346317a518", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW4c", 
        "hash": "9094c1b59f5075f7", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "ce00d7835ab99889", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_5", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "9b8e49cfa8cc8155", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_3", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "93d14b636524c5e6", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "7c3bb1d0f4348302", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW4c", 
        "hash": "c42c8ca1ed5063f8", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_1", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "c50627091e9dbb39", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_6", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "d8e094a2b2a6b0a4", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_2", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "797248b0a125ff8d", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "a19d4dacf72f18f3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW4c", 
        "hash": "6859ebc900b36a30", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_2", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "905cac01fdd8fdf0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_7", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "234c7bbcfe12b552", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_1", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ], 
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "4804f3c6094a9148", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "e2fccacfae4878e3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW4c", 
        "hash": "b6dd6805b5e95fa3", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_3", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "2fd037687d7155f3", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_8", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "c94da1f25e42a84a", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW1c", 
        "hash": "7b91ead92f004604", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_sigmoid", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "out_layout": "NCHW1c", 
        "kernel_layout": "OIHW1i1o", 
        "hash": "b1da1a322b0fbbd8", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_sigmoid", 
        "data_layout": "NCHW1c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_6", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW1c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "82d4d29db9405d14", 
        "func_name": "tvmgen_default_fused_layout_transform_6", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          117, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    26, 
    27, 
    28, 
    29, 
    32, 
    33, 
    34, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    44, 
    46, 
    47, 
    48, 
    49, 
    52, 
    53, 
    54, 
    55, 
    58, 
    59, 
    60, 
    62, 
    63, 
    64, 
    65, 
    68, 
    69, 
    70, 
    71, 
    74, 
    75, 
    76, 
    78, 
    79, 
    80, 
    81, 
    84, 
    85, 
    86, 
    87, 
    90, 
    91, 
    92, 
    94, 
    95, 
    96, 
    97, 
    100, 
    101, 
    102, 
    103, 
    106, 
    107, 
    108, 
    110, 
    111, 
    112, 
    115, 
    116
  ], 
  "heads": [
    [
      118, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 512, 512], 
        [1, 1, 512, 512, 3], 
        [4, 1, 3, 3, 3, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 512, 512, 4], 
        [4, 4, 3, 3, 4, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 512, 512, 4], 
        [1, 4, 256, 256, 4], 
        [8, 4, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 256, 256, 4], 
        [8, 8, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 256, 256, 4], 
        [1, 8, 128, 128, 4], 
        [16, 8, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 128, 128, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 128, 128, 4], 
        [1, 16, 64, 64, 4], 
        [32, 16, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 64, 64, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 64, 64, 4], 
        [1, 32, 32, 32, 4], 
        [64, 32, 3, 3, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 32, 32, 4], 
        [64, 64, 3, 3, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 32, 32, 4], 
        [1, 256, 32, 32], 
        [256, 128, 3, 3], 
        [1, 128, 1, 1], 
        [1, 128, 1, 1], 
        [1, 128, 1, 1], 
        [1, 128, 64, 64], 
        [1, 64, 64, 64, 4], 
        [32, 64, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 64, 64, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 64, 64, 4], 
        [1, 128, 64, 64], 
        [128, 64, 3, 3], 
        [1, 64, 1, 1], 
        [1, 64, 1, 1], 
        [1, 64, 1, 1], 
        [1, 64, 128, 128], 
        [1, 32, 128, 128, 4], 
        [16, 32, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 128, 128, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 128, 128, 4], 
        [1, 64, 128, 128], 
        [64, 32, 3, 3], 
        [1, 32, 1, 1], 
        [1, 32, 1, 1], 
        [1, 32, 1, 1], 
        [1, 32, 256, 256], 
        [1, 16, 256, 256, 4], 
        [8, 16, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 256, 256, 4], 
        [8, 8, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 256, 256, 4], 
        [1, 32, 256, 256], 
        [32, 16, 3, 3], 
        [1, 16, 1, 1], 
        [1, 16, 1, 1], 
        [1, 16, 1, 1], 
        [1, 16, 512, 512], 
        [1, 8, 512, 512, 4], 
        [4, 8, 3, 3, 4, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 512, 512, 4], 
        [4, 4, 3, 3, 4, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 512, 512, 4], 
        [1, 16, 512, 512, 1], 
        [1, 16, 3, 3, 1, 1], 
        [1, 1, 1], 
        [1, 1, 512, 512, 1], 
        [1, 1, 512, 512]
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        9, 
        1, 
        5, 
        10, 
        11, 
        12, 
        13, 
        14, 
        15, 
        16, 
        17, 
        5, 
        13, 
        18, 
        19, 
        20, 
        21, 
        22, 
        23, 
        24, 
        25, 
        13, 
        21, 
        26, 
        27, 
        28, 
        29, 
        30, 
        31, 
        32, 
        33, 
        21, 
        29, 
        34, 
        35, 
        36, 
        37, 
        38, 
        39, 
        40, 
        41, 
        29, 
        37, 
        42, 
        43, 
        44, 
        45, 
        29, 
        37, 
        46, 
        47, 
        48, 
        29, 
        49, 
        50, 
        51, 
        52, 
        21, 
        29, 
        53, 
        54, 
        55, 
        56, 
        37, 
        21, 
        57, 
        58, 
        59, 
        37, 
        60, 
        61, 
        62, 
        63, 
        13, 
        37, 
        64, 
        65, 
        66, 
        67, 
        21, 
        13, 
        68, 
        69, 
        70, 
        21, 
        71, 
        72, 
        73, 
        74, 
        5, 
        21, 
        75, 
        76, 
        77, 
        78, 
        13, 
        5, 
        79, 
        80, 
        81, 
        1, 
        82, 
        83, 
        84, 
        13, 
        1, 
        85, 
        86, 
        29, 
        37
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119
  ]
}