{
    "nodes": [
        {
            "op": "null",
            "name": "input_0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p0",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p1",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p2",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p3",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add_nn_leaky_relu",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "514ee75e62af8f4f"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ],
                [
                    1,
                    0,
                    0
                ],
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ],
                [
                    4,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p4",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p5",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p6",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "5",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_nn_bias_add_multiply_add",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "aad22f9d42ab3819"
            },
            "inputs": [
                [
                    5,
                    0,
                    0
                ],
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ],
                [
                    8,
                    0,
                    0
                ],
                [
                    9,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        2,
        3,
        4,
        6,
        7,
        8,
        9
    ],
    "heads": [
        [
            10,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                3,
                4,
                5,
                6,
                7,
                8,
                9,
                10
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    3,
                    512,
                    512
                ],
                [
                    16,
                    3,
                    3,
                    3
                ],
                [
                    16
                ],
                [
                    16,
                    1,
                    1
                ],
                [
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    16,
                    16,
                    3,
                    3
                ],
                [
                    16
                ],
                [
                    16,
                    1,
                    1
                ],
                [
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11
    ],
    "extra": {
        "inputs": [
            0
        ],
        "outputs": [
            10
        ]
    }
}