{"nodes": [{"op": "null", "name": "p158", "inputs": []}], "arg_nodes": [0], "heads": [[0, 0, 0]], "attrs": {"dltype": ["list_str", ["int32"]], "device_index": ["list_int", [2]], "storage_id": ["list_int", [165]], "shape": ["list_shape", [[6]]]}, "node_row_ptr": [0, 1], "extra": {"inputs": [60], "outputs": [0]}}