{"nodes": [{"op": "null", "name": "input_0", "inputs": []}, {"op": "null", "name": "p0", "inputs": []}, {"op": "null", "name": "p1", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "1a5222ff5b4d3f31"}, "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]}, {"op": "null", "name": "p2", "inputs": []}, {"op": "null", "name": "p3", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_1", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "6b7365b8a19b589e"}, "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]}, {"op": "null", "name": "p4", "inputs": []}, {"op": "null", "name": "p5", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_2", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "98ae96a9aceb3936"}, "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]}, {"op": "null", "name": "p6", "inputs": []}, {"op": "null", "name": "p7", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "1a5f585e6000abac"}, "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [6, 0, 0]]}, {"op": "null", "name": "p8", "inputs": []}, {"op": "null", "name": "p9", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_3", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_3", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "b982003068c99e29"}, "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]}, {"op": "null", "name": "p10", "inputs": []}, {"op": "null", "name": "p11", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_4", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "645a230e41db51f4"}, "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]}, {"op": "null", "name": "p12", "inputs": []}, {"op": "null", "name": "p13", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_1", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "007c291b6a6784f0"}, "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [15, 0, 0]]}, {"op": "null", "name": "p14", "inputs": []}, {"op": "null", "name": "p15", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_41", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_4", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "645a230e41db51f4"}, "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]}, {"op": "null", "name": "p16", "inputs": []}, {"op": "null", "name": "p17", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_11", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_1", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "007c291b6a6784f0"}, "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [21, 0, 0]]}, {"op": "null", "name": "p18", "inputs": []}, {"op": "null", "name": "p19", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_5", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_5", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "8e83d1d13c50c2b5"}, "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]}, {"op": "null", "name": "p20", "inputs": []}, {"op": "null", "name": "p21", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_6", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "494f2f3f4c75d898"}, "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]}, {"op": "null", "name": "p22", "inputs": []}, {"op": "null", "name": "p23", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_2", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "eeb5d12ae211d922"}, "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [30, 0, 0]]}, {"op": "null", "name": "p24", "inputs": []}, {"op": "null", "name": "p25", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_61", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "494f2f3f4c75d898"}, "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]}, {"op": "null", "name": "p26", "inputs": []}, {"op": "null", "name": "p27", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_21", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "eeb5d12ae211d922"}, "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [36, 0, 0]]}, {"op": "null", "name": "p28", "inputs": []}, {"op": "null", "name": "p29", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_62", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "494f2f3f4c75d898"}, "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]}, {"op": "null", "name": "p30", "inputs": []}, {"op": "null", "name": "p31", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_22", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "eeb5d12ae211d922"}, "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [42, 0, 0]]}, {"op": "null", "name": "p32", "inputs": []}, {"op": "null", "name": "p33", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_63", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "494f2f3f4c75d898"}, "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]}, {"op": "null", "name": "p34", "inputs": []}, {"op": "null", "name": "p35", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_23", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "eeb5d12ae211d922"}, "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [48, 0, 0]]}, {"op": "null", "name": "p36", "inputs": []}, {"op": "null", "name": "p37", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_64", "attrs": {"num_outputs": "1", "num_inputs": "3", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_6", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "494f2f3f4c75d898"}, "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]}, {"op": "null", "name": "p38", "inputs": []}, {"op": "null", "name": "p39", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_24", "attrs": {"num_outputs": "1", "num_inputs": "4", "flatten_data": "0", "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_leaky_relu_add_2", "out_layout": "", "kernel_layout": "OIHW", "data_layout": "NCHW", "hash": "eeb5d12ae211d922"}, "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [54, 0, 0]]}], "arg_nodes": [0, 1, 2, 4, 5, 7, 8, 10, 11, 13, 14, 16, 17, 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38, 40, 41, 43, 44, 46, 47, 49, 50, 52, 53, 55, 56, 58, 59], "heads": [[60, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [0, 1, 2, 3, 4, 5, 6, 7, 8, 3, 9, 10, 11, 12, 13, 6, 14, 15, 11, 16, 17, 3, 18, 19, 11, 20, 21, 6, 22, 23, 11, 24, 25, 6, 26, 27, 3, 28, 29, 6, 30, 31, 11, 32, 33, 6, 34, 35, 3, 36, 37, 6, 38, 39, 11, 40, 41, 6, 42, 43, 3]], "shape": ["list_shape", [[1, 3, 416, 416], [32, 3, 3, 3], [1, 32, 1, 1], [1, 32, 416, 416], [64, 32, 3, 3], [1, 64, 1, 1], [1, 64, 208, 208], [32, 64, 1, 1], [1, 32, 1, 1], [1, 32, 208, 208], [64, 32, 3, 3], [1, 64, 1, 1], [1, 64, 208, 208], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 104, 104], [64, 128, 1, 1], [1, 64, 1, 1], [1, 64, 104, 104], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 104, 104], [64, 128, 1, 1], [1, 64, 1, 1], [1, 64, 104, 104], [128, 64, 3, 3], [1, 128, 1, 1], [1, 128, 104, 104], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 52, 52], [128, 256, 1, 1], [1, 128, 1, 1], [1, 128, 52, 52], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 52, 52], [128, 256, 1, 1], [1, 128, 1, 1], [1, 128, 52, 52], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 52, 52], [128, 256, 1, 1], [1, 128, 1, 1], [1, 128, 52, 52], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 52, 52], [128, 256, 1, 1], [1, 128, 1, 1], [1, 128, 52, 52], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 52, 52], [128, 256, 1, 1], [1, 128, 1, 1], [1, 128, 52, 52], [256, 128, 3, 3], [1, 256, 1, 1], [1, 256, 52, 52]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61], "extra": {"inputs": [0], "outputs": [60]}}