{"nodes": [{"op": "null", "name": "input_11", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "5368d86f3206266c", "func_name": "tvmgen_default_fused_nn_max_pool2d", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": []}, {"op": "null", "name": "p80", "inputs": []}, {"op": "null", "name": "p81", "inputs": []}, {"op": "null", "name": "p82", "inputs": []}, {"op": "null", "name": "p83", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_8", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "24d2e0290102969f", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_8", "out_layout": "", "flatten_data": "0"}, "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_max_pool2d_4", "attrs": {"num_outputs": "1", "out_layout": "", "hash": "0b8f56d6e185e11a", "func_name": "tvmgen_default_fused_nn_max_pool2d_4", "layout": "NCHW", "flatten_data": "0", "num_inputs": "1"}, "inputs": [[5, 0, 0]]}], "arg_nodes": [0, 1, 2, 3, 4], "heads": [[6, 0, 0]], "attrs": {"dltype": ["list_str", ["float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [11, 104, 105, 106, 107, 98, 108]], "shape": ["list_shape", [[1, 64, 128, 128], [32, 64, 3, 3], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 1, 1], [1, 32, 128, 128], [1, 32, 64, 64]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7], "extra": {"inputs": [11], "outputs": [113]}}