{
    "nodes": [
        {
            "op": "null",
            "name": "input_0",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "input_1",
            "inputs": []  
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate",
                "hash": "88c150325a68c3fc"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ],
                [
                    0,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p6",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "3",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "56960bee02aea6ca"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ],
                [
                    4,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p8",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p9",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "3",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "61cdf1c6242552b1"
            },
            "inputs": [
                [
                    5,
                    0,
                    0
                ],
                [
                    6,
                    0,
                    0
                ],
                [
                    7,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        3,
        4,
        6,
        7
    ],
    "heads": [
        [
            8,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                3,
                4,
                7,
                10,
                11,
                4,
                12,
                13,
                3
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    32,
                    512,
                    512
                ],
                [
                    16,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    1,
                    1
                ],
                [
                    1,
                    1,
                    512,
                    512
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9
    ]
}