{
    "nodes": [
        {
            "op": "null",
            "name": "noop_0",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "noop_1",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "noop_2",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "input_3",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "noop_4",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "noop_5",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "input_6",
            "inputs": []
        },
        {
            "op": "null",
            "name": "noop_7",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "noop_8",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "noop_9",
            "inputs": []  
        },
        {
            "op": "null",
            "name": "input_10",
            "inputs": []  
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_concatenate",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "2",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_concatenate",
                "hash": "88c150325a68c3fc"
            },
            "inputs": [
                [
                    10,
                    0,
                    0
                ],
                [
                    3,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p6",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p7",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_2",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "3",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_2",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "56960bee02aea6ca"
            },
            "inputs": [
                [
                    11,
                    0,
                    0
                ],
                [
                    12,
                    0,
                    0
                ],
                [
                    13,
                    0,
                    0
                ]
            ]
        },
        {
            "op": "null",
            "name": "p8",
            "inputs": []
        },
        {
            "op": "null",
            "name": "p9",
            "inputs": []
        },
        {
            "op": "tvm_op",
            "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
            "attrs": {
                "num_outputs": "1",
                "num_inputs": "3",
                "flatten_data": "0",
                "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid",
                "out_layout": "",
                "kernel_layout": "OIHW",
                "data_layout": "NCHW",
                "hash": "61cdf1c6242552b1"
            },
            "inputs": [
                [
                    14,
                    0,
                    0
                ],
                [
                    15,
                    0,
                    0
                ],
                [
                    16,
                    0,
                    0
                ]
            ]
        }
    ],
    "arg_nodes": [
        0,
        1,
        2,
        3,
        5,
        6,
        8,
        9,
        10,
        12,
        13,
        15,
        16
    ],
    "heads": [
        [
            17,
            0,
            0
        ]
    ],
    "attrs": {
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32",
                "float32"
            ]
        ],
        "device_index": [
            "list_int",
            [
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2,
                2
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                3,
                4,
                5,
                6,
                7,
                8,
                9,
                4,
                7,
                10,
                11,
                4,
                12,
                13,
                3
            ]
        ],
        "shape": [
            "list_shape",
            [
                [
                    1,
                    3,
                    512,
                    512
                ],
                [
                    16,
                    3,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    256,
                    256
                ],
                [
                    32,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    32,
                    1,
                    1
                ],
                [
                    1,
                    32,
                    256,
                    256
                ],
                [
                    32,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    32,
                    512,
                    512
                ],
                [
                    16,
                    32,
                    3,
                    3
                ],
                [
                    1,
                    16,
                    1,
                    1
                ],
                [
                    1,
                    16,
                    512,
                    512
                ],
                [
                    1,
                    16,
                    3,
                    3
                ],
                [
                    1,
                    1,
                    1
                ],
                [
                    1,
                    1,
                    512,
                    512
                ]
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18
    ]
}