{"nodes": [{"op": "null", "name": "input_157", "attrs": {"num_outputs": "1", "num_inputs": "5", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "06e82a42cfc49b69", "func_name": "tvmgen_default_fused_nn_conv2d_add_multiply_add_nn_leaky_relu_multiply_round_clip_cast_10", "out_layout": "", "flatten_data": "0"}, "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_cast_divide1", "attrs": {"num_outputs": "1", "num_inputs": "1", "flatten_data": "0", "hash": "fa27adaace0bfe80", "func_name": "tvmgen_default_fused_cast_divide"}, "inputs": [[0, 0, 0]]}, {"op": "null", "name": "p100", "inputs": []}, {"op": "null", "name": "p101", "inputs": []}, {"op": "null", "name": "p102", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_add", "attrs": {"num_outputs": "1", "num_inputs": "4", "data_layout": "NCHW", "kernel_layout": "OIHW", "hash": "77de8dba2b8736c1", "func_name": "tvmgen_default_fused_nn_conv2d_add_add", "out_layout": "", "flatten_data": "0"}, "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]}, {"op": "null", "name": "p103", "inputs": []}, {"op": "null", "name": "p104", "inputs": []}, {"op": "tvm_op", "name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "attrs": {"num_outputs": "1", "num_inputs": "3", "out_layout": "", "kernel_layout": "OIHW", "hash": "a8d52321c749ea24", "func_name": "tvmgen_default_fused_nn_conv2d_add_sigmoid", "data_layout": "NCHW", "flatten_data": "0"}, "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]}], "arg_nodes": [0, 2, 3, 4, 6, 7], "heads": [[8, 0, 0]], "attrs": {"dltype": ["list_str", ["int8", "float32", "float32", "float32", "float32", "float32", "float32", "float32", "float32"]], "device_index": ["list_int", [2, 2, 2, 2, 2, 2, 2, 2, 2]], "storage_id": ["list_int", [130, 125, 131, 132, 133, 134, 135, 136, 137]], "shape": ["list_shape", [[1, 64, 256, 256], [1, 64, 256, 256], [64, 64, 3, 3], [1, 64, 1, 1], [1, 64, 1, 1], [1, 64, 256, 256], [1, 64, 3, 3], [1, 1, 1], [1, 1, 256, 256]]]}, "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9], "extra": {"inputs": [157], "outputs": [165]}}